{"Premises": ["Justin is mature", "Justin is kind", "Justin is honest"], "Rules": ["If a person is confident and kind then this person is positive.", "If a person is calm and nervous then this person is creative.", "If a person is calm then this person is intelligent.", "If a person is mature and quiet then this person is careless.", "If a person is intelligent then this person is intelligent.", "If a person is careless then this person is confident.", "If a person is nervous and wise then this person is wise."], "Phenomenon": "Justin is positive", "PossibleCause": "Justin is quiet", "Label": "True"}
{"Premises": ["Betty is nervous", "Betty is friendly", "Betty is trustworthy"], "Rules": ["If a person is wise then this person is angry.", "If a person is careless then this person is kind.", "If a person is angry and friendly then this person is curious.", "If a person is responsible then this person is responsible.", "If a person is nervous and intelligent then this person is wise.", "If a person is beautiful and mature then this person is mature.", "If a person is generous and responsible then this person is mature."], "Phenomenon": "Betty is curious", "PossibleCause": "Betty is intelligent", "Label": "True"}
{"Premises": ["Bob is outgoing", "Bob is beautiful", "Bob is patient"], "Rules": ["If a person is wise and lazy then this person is loyal.", "If a person is outgoing and brave then this person is calm.", "If a person is curious then this person is careless.", "If a person is calm then this person is kind.", "If a person is kind and beautiful then this person is confident.", "If a person is curious and wise then this person is creative.", "If a person is wise then this person is lazy."], "Phenomenon": "Bob is confident", "PossibleCause": "Bob is brave", "Label": "True"}
{"Premises": ["Gary is trustworthy", "Gary is calm", "Gary is careless", "David is mature", "David is careless"], "Rules": ["If a person is trustworthy and beautiful then this person is kind.", "If a person is kind then this person is generous.", "If a person is patient then this person is excited.", "If a person is enthusiastic and enthusiastic then this person is intelligent.", "If a person is enthusiastic then this person is patient.", "If a person is lazy and patient then this person is excited.", "If a person is generous and calm then this person is mature."], "Phenomenon": "Gary is mature", "PossibleCause": "Gary is beautiful", "Label": "True"}
{"Premises": ["Jane is outgoing", "Jane is shy", "Jane is enthusiastic"], "Rules": ["If a person is responsible then this person is honest.", "If a person is angry and quiet then this person is brave.", "If a person is intelligent then this person is calm.", "If a person is angry and angry then this person is quiet.", "If a person is calm and shy then this person is mature.", "If a person is outgoing and happy then this person is intelligent.", "If a person is lazy then this person is responsible."], "Phenomenon": "Jane is mature", "PossibleCause": "Jane is happy", "Label": "True"}
{"Premises": ["Helen is intelligent", "Helen is mature", "Helen is positive"], "Rules": ["If a person is curious then this person is calm.", "If a person is trustworthy then this person is enthusiastic.", "If a person is shy and mature then this person is kind.", "If a person is honest and honest then this person is careless.", "If a person is curious and honest then this person is enthusiastic.", "If a person is outgoing then this person is shy.", "If a person is intelligent and brave then this person is outgoing."], "Phenomenon": "Helen is kind", "PossibleCause": "Helen is brave", "Label": "True"}
{"Premises": ["Tom is outgoing", "Tom is honest", "Tom is generous"], "Rules": ["If a person is friendly then this person is excited.", "If a person is wise and honest then this person is patient.", "If a person is kind then this person is wise.", "If a person is outgoing and responsible then this person is kind.", "If a person is intelligent then this person is intelligent.", "If a person is loyal and excited then this person is excited.", "If a person is mature and loyal then this person is excited."], "Phenomenon": "Tom is patient", "PossibleCause": "Tom is responsible", "Label": "True"}
{"Premises": ["Charles is creative", "Charles is calm", "Charles is humorous"], "Rules": ["If a person is generous and calm then this person is quiet.", "If a person is creative and positive then this person is brave.", "If a person is brave then this person is generous.", "If a person is excited and curious then this person is curious.", "If a person is happy then this person is curious.", "If a person is happy then this person is curious.", "If a person is happy and happy then this person is confident."], "Phenomenon": "Charles is quiet", "PossibleCause": "Charles is positive", "Label": "True"}
{"Premises": ["Lucy is kind", "Lucy is happy", "Lucy is friendly"], "Rules": ["If a person is patient and patient then this person is brave.", "If a person is intelligent then this person is mature.", "If a person is mature and happy then this person is calm.", "If a person is curious and brave then this person is excited.", "If a person is patient then this person is creative.", "If a person is kind and shy then this person is intelligent.", "If a person is generous then this person is creative."], "Phenomenon": "Lucy is calm", "PossibleCause": "Lucy is shy", "Label": "True"}
{"Premises": ["Charles is nervous", "Charles is enthusiastic", "Charles is creative"], "Rules": ["If a person is shy then this person is outgoing.", "If a person is intelligent then this person is confident.", "If a person is nervous and excited then this person is shy.", "If a person is intelligent then this person is lazy.", "If a person is brave and friendly then this person is lazy.", "If a person is outgoing and enthusiastic then this person is wise.", "If a person is curious and friendly then this person is generous."], "Phenomenon": "Charles is wise", "PossibleCause": "Charles is excited", "Label": "True"}
{"Premises": ["Eric is lazy", "Eric is kind", "Eric is trustworthy"], "Rules": ["If a person is humorous and mature then this person is mature.", "If a person is quiet and kind then this person is honest.", "If a person is calm and mature then this person is mature.", "If a person is confident then this person is quiet.", "If a person is lazy and curious then this person is confident.", "If a person is patient then this person is patient.", "If a person is humorous then this person is brave."], "Phenomenon": "Eric is honest", "PossibleCause": "Eric is curious", "Label": "True"}
{"Premises": ["Grace is careless", "Grace is responsible", "Grace is intelligent"], "Rules": ["If a person is curious then this person is friendly.", "If a person is careless and happy then this person is patient.", "If a person is mature and excited then this person is excited.", "If a person is creative and responsible then this person is calm.", "If a person is patient then this person is creative.", "If a person is mature then this person is excited.", "If a person is mature and outgoing then this person is friendly."], "Phenomenon": "Grace is calm", "PossibleCause": "Grace is happy", "Label": "True"}
{"Premises": ["Grace is happy", "Grace is mature", "Grace is responsible"], "Rules": ["If a person is friendly and mature then this person is intelligent.", "If a person is kind then this person is friendly.", "If a person is happy and positive then this person is kind.", "If a person is curious then this person is wise.", "If a person is curious and lazy then this person is confident.", "If a person is curious and lazy then this person is honest.", "If a person is careless then this person is lazy."], "Phenomenon": "Grace is intelligent", "PossibleCause": "Grace is positive", "Label": "True"}
{"Premises": ["Sandy is trustworthy", "Sandy is brave", "Sandy is lazy"], "Rules": ["If a person is loyal and brave then this person is wise.", "If a person is curious then this person is loyal.", "If a person is patient and honest then this person is careless.", "If a person is beautiful then this person is generous.", "If a person is beautiful and careless then this person is generous.", "If a person is beautiful then this person is generous.", "If a person is trustworthy and humorous then this person is curious."], "Phenomenon": "Sandy is wise", "PossibleCause": "Sandy is humorous", "Label": "True"}
{"Premises": ["Anne is generous", "Anne is careless", "Anne is mature"], "Rules": ["If a person is nervous then this person is loyal.", "If a person is nervous then this person is loyal.", "If a person is enthusiastic and enthusiastic then this person is loyal.", "If a person is angry then this person is outgoing.", "If a person is lazy and nervous then this person is loyal.", "If a person is outgoing and careless then this person is positive.", "If a person is generous and intelligent then this person is angry."], "Phenomenon": "Anne is positive", "PossibleCause": "Anne is intelligent", "Label": "True"}
{"Premises": ["Adam is brave", "Adam is nervous", "Adam is humorous"], "Rules": ["If a person is brave and curious then this person is careless.", "If a person is trustworthy and nervous then this person is creative.", "If a person is generous then this person is outgoing.", "If a person is friendly then this person is outgoing.", "If a person is careless then this person is trustworthy.", "If a person is kind and loyal then this person is wise.", "If a person is generous and outgoing then this person is loyal."], "Phenomenon": "Adam is creative", "PossibleCause": "Adam is curious", "Label": "True"}
{"Premises": ["Ted is mature", "Ted is careless", "Ted is trustworthy"], "Rules": ["If a person is patient then this person is angry.", "If a person is happy and careless then this person is wise.", "If a person is enthusiastic then this person is enthusiastic.", "If a person is mature and excited then this person is quiet.", "If a person is positive and beautiful then this person is angry.", "If a person is beautiful and beautiful then this person is kind.", "If a person is quiet then this person is happy."], "Phenomenon": "Ted is wise", "PossibleCause": "Ted is excited", "Label": "True"}
{"Premises": ["Jessica is calm", "Jessica is enthusiastic", "Jessica is curious"], "Rules": ["If a person is brave then this person is happy.", "If a person is positive and trustworthy then this person is wise.", "If a person is calm and responsible then this person is intelligent.", "If a person is quiet and enthusiastic then this person is friendly.", "If a person is intelligent then this person is quiet.", "If a person is positive then this person is wise.", "If a person is brave and happy then this person is happy."], "Phenomenon": "Jessica is friendly", "PossibleCause": "Jessica is responsible", "Label": "True"}
{"Premises": ["Gary is honest", "Gary is positive", "Gary is patient"], "Rules": ["If a person is quiet and careless then this person is lazy.", "If a person is enthusiastic and positive then this person is friendly.", "If a person is honest and nervous then this person is brave.", "If a person is careless then this person is happy.", "If a person is kind and quiet then this person is happy.", "If a person is brave then this person is enthusiastic.", "If a person is quiet then this person is careless."], "Phenomenon": "Gary is friendly", "PossibleCause": "Gary is nervous", "Label": "True"}
{"Premises": ["Jane is honest", "Jane is humorous", "Jane is friendly"], "Rules": ["If a person is honest and nervous then this person is outgoing.", "If a person is enthusiastic then this person is creative.", "If a person is trustworthy and calm then this person is creative.", "If a person is outgoing then this person is shy.", "If a person is shy and humorous then this person is positive.", "If a person is trustworthy and wise then this person is calm.", "If a person is wise then this person is creative."], "Phenomenon": "Jane is positive", "PossibleCause": "Jane is nervous", "Label": "True"}
{"Premises": ["Adam is wise", "Adam is intelligent", "Adam is enthusiastic"], "Rules": ["If a person is honest and shy then this person is mature.", "If a person is quiet then this person is brave.", "If a person is trustworthy then this person is shy.", "If a person is brave and intelligent then this person is nervous.", "If a person is honest then this person is angry.", "If a person is careless and angry then this person is mature.", "If a person is wise and curious then this person is quiet."], "Phenomenon": "Adam is nervous", "PossibleCause": "Adam is curious", "Label": "True"}
{"Premises": ["Frank is kind", "Frank is curious", "Frank is careless"], "Rules": ["If a person is outgoing then this person is intelligent.", "If a person is kind and wise then this person is outgoing.", "If a person is intelligent and curious then this person is generous.", "If a person is patient and patient then this person is responsible.", "If a person is loyal and honest then this person is responsible.", "If a person is loyal then this person is honest.", "If a person is loyal then this person is shy."], "Phenomenon": "Frank is generous", "PossibleCause": "Frank is wise", "Label": "True"}
{"Premises": ["Robin is humorous", "Robin is generous", "Robin is excited"], "Rules": ["If a person is trustworthy then this person is friendly.", "If a person is positive then this person is friendly.", "If a person is humorous and creative then this person is intelligent.", "If a person is trustworthy and wise then this person is quiet.", "If a person is intelligent then this person is careless.", "If a person is careless and generous then this person is honest.", "If a person is trustworthy and trustworthy then this person is wise."], "Phenomenon": "Robin is honest", "PossibleCause": "Robin is creative", "Label": "True"}
{"Premises": ["Eric is excited", "Eric is quiet", "Eric is generous"], "Rules": ["If a person is curious then this person is brave.", "If a person is curious and loyal then this person is patient.", "If a person is excited and enthusiastic then this person is honest.", "If a person is confident and creative then this person is patient.", "If a person is confident then this person is loyal.", "If a person is honest then this person is calm.", "If a person is calm and quiet then this person is outgoing."], "Phenomenon": "Eric is outgoing", "PossibleCause": "Eric is enthusiastic", "Label": "True"}
{"Premises": ["Thomas is positive", "Thomas is outgoing", "Thomas is loyal"], "Rules": ["If a person is honest and honest then this person is intelligent.", "If a person is creative then this person is confident.", "If a person is enthusiastic then this person is generous.", "If a person is enthusiastic then this person is generous.", "If a person is positive and patient then this person is creative.", "If a person is confident and outgoing then this person is shy.", "If a person is angry and honest then this person is intelligent."], "Phenomenon": "Thomas is shy", "PossibleCause": "Thomas is patient", "Label": "True"}
{"Premises": ["Robert is beautiful", "Robert is excited", "Robert is calm"], "Rules": ["If a person is positive and positive then this person is happy.", "If a person is beautiful and friendly then this person is loyal.", "If a person is brave then this person is generous.", "If a person is honest and excited then this person is careless.", "If a person is shy and happy then this person is happy.", "If a person is loyal then this person is honest.", "If a person is shy then this person is happy."], "Phenomenon": "Robert is careless", "PossibleCause": "Robert is shy", "Label": "False"}
{"Premises": ["Thomas is excited", "Thomas is wise", "Thomas is nervous"], "Rules": ["If a person is honest and wise then this person is confident.", "If a person is outgoing then this person is humorous.", "If a person is enthusiastic then this person is kind.", "If a person is positive and creative then this person is humorous.", "If a person is excited and responsible then this person is curious.", "If a person is positive and kind then this person is humorous.", "If a person is curious then this person is honest."], "Phenomenon": "Thomas is confident", "PossibleCause": "Thomas is responsible", "Label": "True"}
{"Premises": ["Gary is outgoing", "Gary is patient", "Gary is positive"], "Rules": ["If a person is outgoing and confident then this person is creative.", "If a person is intelligent and patient then this person is mature.", "If a person is lazy and wise then this person is careless.", "If a person is kind and wise then this person is curious.", "If a person is trustworthy then this person is careless.", "If a person is creative then this person is intelligent.", "If a person is kind then this person is humorous."], "Phenomenon": "Gary is mature", "PossibleCause": "Gary is confident", "Label": "True"}
{"Premises": ["Robin is patient", "Robin is shy", "Robin is friendly"], "Rules": ["If a person is brave then this person is calm.", "If a person is patient and generous then this person is confident.", "If a person is kind and excited then this person is positive.", "If a person is confident then this person is mature.", "If a person is mature and shy then this person is careless.", "If a person is kind and calm then this person is curious.", "If a person is calm then this person is curious."], "Phenomenon": "Robin is careless", "PossibleCause": "Robin is generous", "Label": "True"}
{"Premises": ["Gary is lazy", "Gary is curious", "Gary is kind"], "Rules": ["If a person is excited and excited then this person is honest.", "If a person is mature then this person is confident.", "If a person is lazy and enthusiastic then this person is mature.", "If a person is shy then this person is quiet.", "If a person is confident and curious then this person is intelligent.", "If a person is happy and honest then this person is nervous.", "If a person is beautiful then this person is quiet."], "Phenomenon": "Gary is intelligent", "PossibleCause": "Gary is enthusiastic", "Label": "True"}
{"Premises": ["Gary is creative", "Gary is excited", "Gary is loyal"], "Rules": ["If a person is beautiful and patient then this person is lazy.", "If a person is wise and angry then this person is lazy.", "If a person is shy then this person is curious.", "If a person is curious and excited then this person is quiet.", "If a person is patient then this person is kind.", "If a person is wise then this person is kind.", "If a person is creative and honest then this person is shy."], "Phenomenon": "Gary is quiet", "PossibleCause": "Gary is honest", "Label": "True"}
{"Premises": ["Mark is mature", "Mark is calm", "Mark is responsible"], "Rules": ["If a person is brave then this person is curious.", "If a person is enthusiastic and shy then this person is quiet.", "If a person is outgoing and shy then this person is humorous.", "If a person is excited and calm then this person is friendly.", "If a person is mature and wise then this person is trustworthy.", "If a person is enthusiastic then this person is quiet.", "If a person is trustworthy then this person is excited."], "Phenomenon": "Mark is friendly", "PossibleCause": "Mark is wise", "Label": "True"}
{"Premises": ["Ted is excited", "Ted is creative", "Ted is careless"], "Rules": ["If a person is excited and outgoing then this person is humorous.", "If a person is happy and friendly then this person is friendly.", "If a person is lazy and creative then this person is patient.", "If a person is humorous then this person is lazy.", "If a person is kind and intelligent then this person is brave.", "If a person is intelligent then this person is brave.", "If a person is kind then this person is brave."], "Phenomenon": "Ted is patient", "PossibleCause": "Ted is outgoing", "Label": "True"}
{"Premises": ["Jessica is kind", "Jessica is outgoing", "Jessica is generous"], "Rules": ["If a person is calm then this person is angry.", "If a person is lazy then this person is loyal.", "If a person is angry and outgoing then this person is trustworthy.", "If a person is kind and responsible then this person is calm.", "If a person is lazy and loyal then this person is intelligent.", "If a person is lazy and loyal then this person is confident.", "If a person is lazy then this person is intelligent."], "Phenomenon": "Jessica is trustworthy", "PossibleCause": "Jessica is lazy", "Label": "False"}
{"Premises": ["Jessica is angry", "Jessica is excited", "Jessica is trustworthy"], "Rules": ["If a person is careless then this person is generous.", "If a person is shy then this person is creative.", "If a person is wise and wise then this person is confident.", "If a person is angry and curious then this person is shy.", "If a person is careless then this person is confident.", "If a person is brave and wise then this person is generous.", "If a person is creative and excited then this person is patient."], "Phenomenon": "Jessica is patient", "PossibleCause": "Jessica is curious", "Label": "True"}
{"Premises": ["Helen is wise", "Helen is angry", "Helen is shy"], "Rules": ["If a person is enthusiastic and friendly then this person is lazy.", "If a person is confident then this person is loyal.", "If a person is nervous then this person is intelligent.", "If a person is enthusiastic then this person is careless.", "If a person is wise and beautiful then this person is confident.", "If a person is honest and friendly then this person is intelligent.", "If a person is loyal and angry then this person is positive."], "Phenomenon": "Helen is positive", "PossibleCause": "Helen is beautiful", "Label": "True"}
{"Premises": ["Gary is lazy", "Gary is positive", "Gary is careless"], "Rules": ["If a person is curious then this person is enthusiastic.", "If a person is brave then this person is beautiful.", "If a person is lazy and honest then this person is curious.", "If a person is brave and responsible then this person is beautiful.", "If a person is friendly then this person is beautiful.", "If a person is friendly and responsible then this person is quiet.", "If a person is enthusiastic and positive then this person is happy."], "Phenomenon": "Gary is happy", "PossibleCause": "Gary is friendly", "Label": "False"}
{"Premises": ["Mark is excited", "Mark is trustworthy", "Mark is nervous"], "Rules": ["If a person is shy and enthusiastic then this person is lazy.", "If a person is wise and lazy then this person is generous.", "If a person is excited and outgoing then this person is responsible.", "If a person is shy then this person is lazy.", "If a person is shy then this person is lazy.", "If a person is mature and trustworthy then this person is positive.", "If a person is responsible then this person is mature."], "Phenomenon": "Mark is positive", "PossibleCause": "Mark is curious", "Label": "False"}
{"Premises": ["Bob is calm", "Bob is honest", "Bob is outgoing"], "Rules": ["If a person is shy and honest then this person is lazy.", "If a person is loyal and loyal then this person is intelligent.", "If a person is nervous and loyal then this person is positive.", "If a person is brave then this person is intelligent.", "If a person is calm and humorous then this person is trustworthy.", "If a person is loyal then this person is brave.", "If a person is trustworthy then this person is shy."], "Phenomenon": "Bob is lazy", "PossibleCause": "Bob is humorous", "Label": "True"}
{"Premises": ["Mark is lazy", "Mark is responsible", "Mark is intelligent"], "Rules": ["If a person is angry and enthusiastic then this person is shy.", "If a person is lazy and trustworthy then this person is curious.", "If a person is angry and nervous then this person is enthusiastic.", "If a person is outgoing then this person is enthusiastic.", "If a person is brave and responsible then this person is happy.", "If a person is curious then this person is brave.", "If a person is outgoing then this person is nervous."], "Phenomenon": "Mark is happy", "PossibleCause": "Mark is angry", "Label": "False"}
{"Premises": ["Lisa is nervous", "Lisa is outgoing", "Lisa is angry"], "Rules": ["If a person is positive and outgoing then this person is confident.", "If a person is excited then this person is positive.", "If a person is honest and generous then this person is loyal.", "If a person is honest and intelligent then this person is calm.", "If a person is nervous and quiet then this person is excited.", "If a person is intelligent then this person is calm.", "If a person is humorous then this person is brave."], "Phenomenon": "Lisa is confident", "PossibleCause": "Lisa is honest", "Label": "False"}
{"Premises": ["Jack is mature", "Jack is patient", "Jack is confident"], "Rules": ["If a person is generous and kind then this person is creative.", "If a person is brave then this person is calm.", "If a person is enthusiastic then this person is outgoing.", "If a person is friendly and brave then this person is calm.", "If a person is mature and nervous then this person is enthusiastic.", "If a person is generous then this person is calm.", "If a person is outgoing and patient then this person is curious."], "Phenomenon": "Jack is curious", "PossibleCause": "Jack is nervous", "Label": "True"}
{"Premises": ["Robin is lazy", "Robin is mature", "Robin is responsible"], "Rules": ["If a person is intelligent and trustworthy then this person is honest.", "If a person is intelligent then this person is brave.", "If a person is humorous and mature then this person is curious.", "If a person is trustworthy and trustworthy then this person is excited.", "If a person is quiet then this person is humorous.", "If a person is loyal then this person is brave.", "If a person is lazy and kind then this person is quiet."], "Phenomenon": "Robin is curious", "PossibleCause": "Robin is kind", "Label": "True"}
{"Premises": ["Jack is careless", "Jack is responsible", "Jack is kind", "James is kind", "James is happy"], "Rules": ["If a person is lazy and brave then this person is brave.", "If a person is careless and shy then this person is loyal.", "If a person is outgoing then this person is calm.", "If a person is loyal then this person is honest.", "If a person is curious and trustworthy then this person is brave.", "If a person is lazy then this person is brave.", "If a person is honest and responsible then this person is quiet."], "Phenomenon": "Jack is quiet", "PossibleCause": "Jack is shy", "Label": "True"}
{"Premises": ["Gary is honest", "Gary is friendly", "Gary is intelligent"], "Rules": ["If a person is generous then this person is brave.", "If a person is angry and angry then this person is enthusiastic.", "If a person is calm and friendly then this person is patient.", "If a person is generous and brave then this person is careless.", "If a person is curious then this person is enthusiastic.", "If a person is outgoing then this person is calm.", "If a person is honest and kind then this person is outgoing."], "Phenomenon": "Gary is patient", "PossibleCause": "Gary is kind", "Label": "True"}
{"Premises": ["Ted is responsible", "Ted is humorous", "Ted is angry"], "Rules": ["If a person is patient and generous then this person is generous.", "If a person is happy and humorous then this person is shy.", "If a person is honest and kind then this person is friendly.", "If a person is quiet then this person is happy.", "If a person is patient then this person is generous.", "If a person is wise then this person is kind.", "If a person is responsible and lazy then this person is quiet."], "Phenomenon": "Ted is shy", "PossibleCause": "Ted is lazy", "Label": "True"}
{"Premises": ["Charles is curious", "Charles is beautiful", "Charles is brave"], "Rules": ["If a person is kind then this person is calm.", "If a person is confident and intelligent then this person is intelligent.", "If a person is curious and friendly then this person is nervous.", "If a person is nervous then this person is honest.", "If a person is confident and calm then this person is angry.", "If a person is honest and beautiful then this person is generous.", "If a person is loyal then this person is outgoing."], "Phenomenon": "Charles is generous", "PossibleCause": "Charles is friendly", "Label": "True"}
{"Premises": ["Frank is excited", "Frank is outgoing", "Frank is happy"], "Rules": ["If a person is kind and curious then this person is quiet.", "If a person is curious then this person is quiet.", "If a person is excited and responsible then this person is patient.", "If a person is trustworthy and outgoing then this person is confident.", "If a person is patient then this person is trustworthy.", "If a person is brave and positive then this person is friendly.", "If a person is curious then this person is curious."], "Phenomenon": "Frank is confident", "PossibleCause": "Frank is responsible", "Label": "True"}
{"Premises": ["Paul is patient", "Paul is lazy", "Paul is intelligent"], "Rules": ["If a person is honest and honest then this person is angry.", "If a person is confident and lazy then this person is outgoing.", "If a person is positive then this person is positive.", "If a person is enthusiastic and curious then this person is curious.", "If a person is humorous then this person is confident.", "If a person is creative then this person is positive.", "If a person is patient and mature then this person is humorous."], "Phenomenon": "Paul is outgoing", "PossibleCause": "Paul is mature", "Label": "True"}
{"Premises": ["James is calm", "James is generous", "James is loyal"], "Rules": ["If a person is lazy and intelligent then this person is kind.", "If a person is positive and intelligent then this person is humorous.", "If a person is happy then this person is careless.", "If a person is angry then this person is intelligent.", "If a person is calm and beautiful then this person is happy.", "If a person is outgoing then this person is intelligent.", "If a person is careless and generous then this person is mature."], "Phenomenon": "James is mature", "PossibleCause": "James is beautiful", "Label": "True"}
{"Premises": ["Lisa is nervous", "Lisa is patient", "Lisa is shy"], "Rules": ["If a person is intelligent then this person is friendly.", "If a person is calm and loyal then this person is friendly.", "If a person is responsible and patient then this person is excited.", "If a person is quiet and calm then this person is friendly.", "If a person is honest then this person is responsible.", "If a person is nervous and brave then this person is honest.", "If a person is intelligent then this person is loyal."], "Phenomenon": "Lisa is excited", "PossibleCause": "Lisa is brave", "Label": "True"}
{"Premises": ["Thomas is friendly", "Thomas is careless", "Thomas is confident"], "Rules": ["If a person is kind and trustworthy then this person is curious.", "If a person is friendly and honest then this person is positive.", "If a person is kind then this person is outgoing.", "If a person is positive then this person is excited.", "If a person is happy and kind then this person is mature.", "If a person is trustworthy then this person is outgoing.", "If a person is excited and careless then this person is shy."], "Phenomenon": "Thomas is shy", "PossibleCause": "Thomas is honest", "Label": "True"}
{"Premises": ["Jack is patient", "Jack is generous", "Jack is beautiful"], "Rules": ["If a person is nervous and generous then this person is happy.", "If a person is patient and enthusiastic then this person is lazy.", "If a person is intelligent and intelligent then this person is shy.", "If a person is lazy then this person is nervous.", "If a person is kind then this person is calm.", "If a person is kind then this person is careless.", "If a person is mature and intelligent then this person is careless."], "Phenomenon": "Jack is happy", "PossibleCause": "Jack is enthusiastic", "Label": "True"}
{"Premises": ["Eric is humorous", "Eric is happy", "Eric is creative"], "Rules": ["If a person is angry then this person is friendly.", "If a person is patient then this person is responsible.", "If a person is trustworthy then this person is friendly.", "If a person is trustworthy and trustworthy then this person is friendly.", "If a person is responsible and happy then this person is lazy.", "If a person is nervous and trustworthy then this person is wise.", "If a person is humorous and beautiful then this person is patient."], "Phenomenon": "Eric is lazy", "PossibleCause": "Eric is beautiful", "Label": "True"}
{"Premises": ["Adam is beautiful", "Adam is loyal", "Adam is lazy"], "Rules": ["If a person is beautiful and careless then this person is excited.", "If a person is trustworthy and outgoing then this person is generous.", "If a person is excited then this person is angry.", "If a person is responsible then this person is outgoing.", "If a person is trustworthy then this person is outgoing.", "If a person is humorous and trustworthy then this person is mature.", "If a person is angry and loyal then this person is curious."], "Phenomenon": "Adam is curious", "PossibleCause": "Adam is responsible", "Label": "False"}
{"Premises": ["James is creative", "James is honest", "James is responsible"], "Rules": ["If a person is beautiful and honest then this person is kind.", "If a person is patient then this person is beautiful.", "If a person is mature and happy then this person is calm.", "If a person is loyal then this person is happy.", "If a person is loyal and happy then this person is happy.", "If a person is creative and lazy then this person is patient.", "If a person is loyal then this person is calm."], "Phenomenon": "James is kind", "PossibleCause": "James is lazy", "Label": "True"}
{"Premises": ["Peter is curious", "Peter is nervous", "Peter is angry"], "Rules": ["If a person is honest and nervous then this person is brave.", "If a person is outgoing and patient then this person is kind.", "If a person is curious and friendly then this person is excited.", "If a person is outgoing and patient then this person is kind.", "If a person is excited then this person is honest.", "If a person is outgoing then this person is quiet.", "If a person is trustworthy then this person is careless."], "Phenomenon": "Peter is brave", "PossibleCause": "Peter is friendly", "Label": "True"}
{"Premises": ["Bob is honest", "Bob is wise", "Bob is humorous"], "Rules": ["If a person is outgoing then this person is kind.", "If a person is loyal and loyal then this person is lazy.", "If a person is honest and enthusiastic then this person is generous.", "If a person is nervous and happy then this person is lazy.", "If a person is generous then this person is patient.", "If a person is patient and wise then this person is confident.", "If a person is responsible then this person is responsible."], "Phenomenon": "Bob is confident", "PossibleCause": "Bob is enthusiastic", "Label": "True"}
{"Premises": ["Eric is careless", "Eric is outgoing", "Eric is kind"], "Rules": ["If a person is careless and curious then this person is angry.", "If a person is angry then this person is trustworthy.", "If a person is creative then this person is generous.", "If a person is responsible and wise then this person is friendly.", "If a person is nervous and generous then this person is friendly.", "If a person is creative then this person is generous.", "If a person is trustworthy and outgoing then this person is quiet."], "Phenomenon": "Eric is quiet", "PossibleCause": "Eric is curious", "Label": "True"}
{"Premises": ["Jessica is careless", "Jessica is enthusiastic", "Jessica is curious"], "Rules": ["If a person is excited and intelligent then this person is patient.", "If a person is shy then this person is quiet.", "If a person is humorous and lazy then this person is patient.", "If a person is quiet and enthusiastic then this person is creative.", "If a person is careless and kind then this person is shy.", "If a person is lazy then this person is confident.", "If a person is intelligent then this person is intelligent."], "Phenomenon": "Jessica is creative", "PossibleCause": "Jessica is kind", "Label": "True"}
{"Premises": ["Helen is nervous", "Helen is careless", "Helen is friendly"], "Rules": ["If a person is lazy and beautiful then this person is beautiful.", "If a person is brave then this person is loyal.", "If a person is loyal and careless then this person is shy.", "If a person is lazy and beautiful then this person is humorous.", "If a person is confident then this person is confident.", "If a person is nervous and enthusiastic then this person is brave.", "If a person is confident then this person is patient."], "Phenomenon": "Helen is shy", "PossibleCause": "Helen is enthusiastic", "Label": "True"}
{"Premises": ["Tom is generous", "Tom is positive", "Tom is curious"], "Rules": ["If a person is generous and careless then this person is outgoing.", "If a person is responsible then this person is angry.", "If a person is confident and positive then this person is excited.", "If a person is wise and brave then this person is brave.", "If a person is mature then this person is brave.", "If a person is outgoing then this person is confident.", "If a person is responsible and angry then this person is brave."], "Phenomenon": "Tom is excited", "PossibleCause": "Tom is careless", "Label": "True"}
{"Premises": ["Anne is trustworthy", "Anne is positive", "Anne is shy"], "Rules": ["If a person is wise then this person is lazy.", "If a person is creative then this person is creative.", "If a person is beautiful then this person is enthusiastic.", "If a person is mature and mature then this person is enthusiastic.", "If a person is beautiful and creative then this person is loyal.", "If a person is lazy and positive then this person is nervous.", "If a person is trustworthy and careless then this person is wise."], "Phenomenon": "Anne is nervous", "PossibleCause": "Anne is careless", "Label": "True"}
{"Premises": ["Thomas is intelligent", "Thomas is excited", "Thomas is nervous"], "Rules": ["If a person is beautiful then this person is beautiful.", "If a person is calm then this person is generous.", "If a person is intelligent and happy then this person is calm.", "If a person is quiet and beautiful then this person is wise.", "If a person is shy then this person is responsible.", "If a person is shy and beautiful then this person is responsible.", "If a person is generous and excited then this person is confident."], "Phenomenon": "Thomas is confident", "PossibleCause": "Thomas is happy", "Label": "True"}
{"Premises": ["Paul is patient", "Paul is lazy", "Paul is positive"], "Rules": ["If a person is friendly and excited then this person is honest.", "If a person is intelligent then this person is happy.", "If a person is friendly then this person is honest.", "If a person is quiet and lazy then this person is trustworthy.", "If a person is humorous then this person is quiet.", "If a person is friendly and excited then this person is careless.", "If a person is patient and wise then this person is humorous."], "Phenomenon": "Paul is trustworthy", "PossibleCause": "Paul is wise", "Label": "True"}
{"Premises": ["Thomas is humorous", "Thomas is brave", "Thomas is mature"], "Rules": ["If a person is humorous and enthusiastic then this person is intelligent.", "If a person is responsible then this person is positive.", "If a person is angry and positive then this person is calm.", "If a person is responsible and shy then this person is calm.", "If a person is angry then this person is positive.", "If a person is intelligent then this person is confident.", "If a person is confident and brave then this person is honest."], "Phenomenon": "Thomas is honest", "PossibleCause": "Thomas is enthusiastic", "Label": "True"}
{"Premises": ["Charles is happy", "Charles is creative", "Charles is patient"], "Rules": ["If a person is angry then this person is wise.", "If a person is nervous then this person is quiet.", "If a person is mature and angry then this person is kind.", "If a person is outgoing then this person is wise.", "If a person is quiet and creative then this person is careless.", "If a person is happy and intelligent then this person is nervous.", "If a person is honest and angry then this person is kind."], "Phenomenon": "Charles is careless", "PossibleCause": "Charles is intelligent", "Label": "True"}
{"Premises": ["Adam is responsible", "Adam is positive", "Adam is angry"], "Rules": ["If a person is generous then this person is intelligent.", "If a person is responsible and humorous then this person is generous.", "If a person is loyal then this person is excited.", "If a person is loyal and loyal then this person is beautiful.", "If a person is confident and loyal then this person is kind.", "If a person is loyal then this person is nervous.", "If a person is intelligent and positive then this person is wise."], "Phenomenon": "Adam is wise", "PossibleCause": "Adam is humorous", "Label": "True"}
{"Premises": ["Henry is quiet", "Henry is kind", "Henry is responsible"], "Rules": ["If a person is shy then this person is beautiful.", "If a person is happy then this person is intelligent.", "If a person is shy and honest then this person is beautiful.", "If a person is intelligent and kind then this person is mature.", "If a person is friendly then this person is honest.", "If a person is friendly and beautiful then this person is outgoing.", "If a person is quiet and excited then this person is happy."], "Phenomenon": "Henry is mature", "PossibleCause": "Henry is excited", "Label": "True"}
{"Premises": ["Justin is mature", "Justin is calm", "Justin is friendly"], "Rules": ["If a person is confident and careless then this person is careless.", "If a person is creative then this person is responsible.", "If a person is lazy and calm then this person is loyal.", "If a person is mature and patient then this person is nervous.", "If a person is confident and honest then this person is trustworthy.", "If a person is creative then this person is careless.", "If a person is nervous then this person is lazy."], "Phenomenon": "Justin is loyal", "PossibleCause": "Justin is patient", "Label": "True"}
{"Premises": ["Robin is careless", "Robin is intelligent", "Robin is angry"], "Rules": ["If a person is careless and quiet then this person is friendly.", "If a person is lazy and positive then this person is positive.", "If a person is friendly then this person is mature.", "If a person is honest then this person is nervous.", "If a person is lazy then this person is nervous.", "If a person is wise and positive then this person is positive.", "If a person is mature and intelligent then this person is beautiful."], "Phenomenon": "Robin is beautiful", "PossibleCause": "Robin is quiet", "Label": "True"}
{"Premises": ["Thomas is mature", "Thomas is wise", "Thomas is angry"], "Rules": ["If a person is brave and enthusiastic then this person is curious.", "If a person is responsible then this person is shy.", "If a person is excited then this person is calm.", "If a person is happy then this person is calm.", "If a person is mature and trustworthy then this person is responsible.", "If a person is excited and calm then this person is calm.", "If a person is shy and wise then this person is generous."], "Phenomenon": "Thomas is generous", "PossibleCause": "Thomas is trustworthy", "Label": "True"}
{"Premises": ["Gary is angry", "Gary is trustworthy", "Gary is creative"], "Rules": ["If a person is calm then this person is curious.", "If a person is intelligent then this person is humorous.", "If a person is kind and calm then this person is beautiful.", "If a person is humorous and trustworthy then this person is loyal.", "If a person is kind and calm then this person is curious.", "If a person is calm then this person is curious.", "If a person is angry and excited then this person is intelligent."], "Phenomenon": "Gary is loyal", "PossibleCause": "Gary is excited", "Label": "True"}
{"Premises": ["Robert is intelligent", "Robert is humorous", "Robert is careless"], "Rules": ["If a person is trustworthy and lazy then this person is calm.", "If a person is responsible and humorous then this person is confident.", "If a person is lazy and quiet then this person is wise.", "If a person is quiet then this person is calm.", "If a person is intelligent and outgoing then this person is positive.", "If a person is happy then this person is quiet.", "If a person is positive then this person is responsible."], "Phenomenon": "Robert is confident", "PossibleCause": "Robert is outgoing", "Label": "True"}
{"Premises": ["Jane is wise", "Jane is honest", "Jane is outgoing"], "Rules": ["If a person is trustworthy and happy then this person is humorous.", "If a person is trustworthy then this person is friendly.", "If a person is trustworthy then this person is enthusiastic.", "If a person is calm then this person is confident.", "If a person is happy and enthusiastic then this person is humorous.", "If a person is confident and honest then this person is angry.", "If a person is wise and patient then this person is calm."], "Phenomenon": "Jane is angry", "PossibleCause": "Jane is patient", "Label": "True"}
{"Premises": ["Ted is nervous", "Ted is positive", "Ted is careless"], "Rules": ["If a person is shy then this person is quiet.", "If a person is nervous and beautiful then this person is shy.", "If a person is confident and angry then this person is humorous.", "If a person is quiet and positive then this person is responsible.", "If a person is friendly then this person is friendly.", "If a person is honest and angry then this person is generous.", "If a person is friendly then this person is generous."], "Phenomenon": "Ted is responsible", "PossibleCause": "Ted is beautiful", "Label": "True"}
{"Premises": ["Mark is mature", "Mark is beautiful", "Mark is shy"], "Rules": ["If a person is wise and curious then this person is friendly.", "If a person is creative then this person is angry.", "If a person is outgoing then this person is curious.", "If a person is brave and curious then this person is friendly.", "If a person is angry and beautiful then this person is honest.", "If a person is wise then this person is outgoing.", "If a person is mature and quiet then this person is creative."], "Phenomenon": "Mark is honest", "PossibleCause": "Mark is quiet", "Label": "True"}
{"Premises": ["Grace is mature", "Grace is happy", "Grace is patient"], "Rules": ["If a person is careless and responsible then this person is angry.", "If a person is calm then this person is curious.", "If a person is curious and happy then this person is generous.", "If a person is mature and kind then this person is calm.", "If a person is responsible then this person is friendly.", "If a person is humorous and responsible then this person is lazy.", "If a person is humorous then this person is lazy."], "Phenomenon": "Grace is generous", "PossibleCause": "Grace is kind", "Label": "True"}
{"Premises": ["Jack is brave", "Jack is honest", "Jack is creative"], "Rules": ["If a person is careless then this person is nervous.", "If a person is brave and beautiful then this person is careless.", "If a person is generous and calm then this person is positive.", "If a person is nervous and honest then this person is loyal.", "If a person is generous and enthusiastic then this person is quiet.", "If a person is calm then this person is positive.", "If a person is calm then this person is positive."], "Phenomenon": "Jack is loyal", "PossibleCause": "Jack is beautiful", "Label": "True"}
{"Premises": ["Paul is generous", "Paul is creative", "Paul is friendly"], "Rules": ["If a person is excited then this person is angry.", "If a person is nervous then this person is calm.", "If a person is calm and creative then this person is mature.", "If a person is excited and excited then this person is kind.", "If a person is generous and wise then this person is nervous.", "If a person is shy and excited then this person is kind.", "If a person is angry then this person is careless."], "Phenomenon": "Paul is mature", "PossibleCause": "Paul is wise", "Label": "True"}
{"Premises": ["Robin is careless", "Robin is loyal", "Robin is confident"], "Rules": ["If a person is trustworthy then this person is honest.", "If a person is intelligent and intelligent then this person is nervous.", "If a person is careless and friendly then this person is trustworthy.", "If a person is intelligent then this person is angry.", "If a person is honest and loyal then this person is enthusiastic.", "If a person is intelligent and intelligent then this person is nervous.", "If a person is mature then this person is angry."], "Phenomenon": "Robin is enthusiastic", "PossibleCause": "Robin is friendly", "Label": "True"}
{"Premises": ["Jane is happy", "Jane is honest", "Jane is quiet"], "Rules": ["If a person is happy and shy then this person is kind.", "If a person is nervous and creative then this person is confident.", "If a person is loyal and honest then this person is trustworthy.", "If a person is patient and confident then this person is humorous.", "If a person is nervous then this person is confident.", "If a person is nervous then this person is creative.", "If a person is kind then this person is loyal."], "Phenomenon": "Jane is trustworthy", "PossibleCause": "Jane is excited", "Label": "False"}
{"Premises": ["Ted is trustworthy", "Ted is loyal", "Ted is careless"], "Rules": ["If a person is brave and intelligent then this person is patient.", "If a person is excited then this person is enthusiastic.", "If a person is enthusiastic and loyal then this person is happy.", "If a person is brave then this person is patient.", "If a person is honest and honest then this person is intelligent.", "If a person is brave then this person is intelligent.", "If a person is trustworthy and shy then this person is excited."], "Phenomenon": "Ted is happy", "PossibleCause": "Ted is brave", "Label": "False"}
{"Premises": ["Lisa is kind", "Lisa is generous", "Lisa is curious", "Helen is curious", "Helen is nervous"], "Rules": ["If a person is kind and shy then this person is trustworthy.", "If a person is excited then this person is intelligent.", "If a person is trustworthy then this person is careless.", "If a person is careless and generous then this person is loyal.", "If a person is enthusiastic and intelligent then this person is confident.", "If a person is enthusiastic then this person is confident.", "If a person is enthusiastic and enthusiastic then this person is outgoing."], "Phenomenon": "Lisa is loyal", "PossibleCause": "Lisa is shy", "Label": "True"}
{"Premises": ["Frank is positive", "Frank is humorous", "Frank is excited"], "Rules": ["If a person is patient then this person is generous.", "If a person is patient and generous then this person is generous.", "If a person is trustworthy then this person is outgoing.", "If a person is outgoing and humorous then this person is confident.", "If a person is positive and responsible then this person is trustworthy.", "If a person is calm and careless then this person is loyal.", "If a person is honest then this person is loyal."], "Phenomenon": "Frank is confident", "PossibleCause": "Frank is calm", "Label": "False"}
{"Premises": ["Betty is beautiful", "Betty is careless", "Betty is brave"], "Rules": ["If a person is mature then this person is loyal.", "If a person is beautiful and intelligent then this person is mature.", "If a person is angry then this person is calm.", "If a person is positive and angry then this person is calm.", "If a person is positive and happy then this person is quiet.", "If a person is loyal and careless then this person is shy.", "If a person is honest then this person is calm."], "Phenomenon": "Betty is shy", "PossibleCause": "Betty is intelligent", "Label": "True"}
{"Premises": ["Betty is confident", "Betty is angry", "Betty is brave"], "Rules": ["If a person is mature then this person is shy.", "If a person is friendly then this person is generous.", "If a person is shy and angry then this person is humorous.", "If a person is lazy and friendly then this person is loyal.", "If a person is excited then this person is generous.", "If a person is lazy and loyal then this person is loyal.", "If a person is confident and intelligent then this person is mature."], "Phenomenon": "Betty is humorous", "PossibleCause": "Betty is intelligent", "Label": "True"}
{"Premises": ["Robin is happy", "Robin is wise", "Robin is quiet"], "Rules": ["If a person is beautiful then this person is creative.", "If a person is shy and lazy then this person is generous.", "If a person is lazy then this person is lazy.", "If a person is happy and trustworthy then this person is beautiful.", "If a person is creative and wise then this person is honest.", "If a person is lazy then this person is enthusiastic.", "If a person is shy and friendly then this person is enthusiastic."], "Phenomenon": "Robin is honest", "PossibleCause": "Robin is calm", "Label": "False"}
{"Premises": ["Thomas is loyal", "Thomas is excited", "Thomas is generous"], "Rules": ["If a person is enthusiastic and curious then this person is careless.", "If a person is quiet then this person is calm.", "If a person is nervous then this person is friendly.", "If a person is friendly and excited then this person is kind.", "If a person is enthusiastic then this person is creative.", "If a person is quiet and enthusiastic then this person is creative.", "If a person is loyal and lazy then this person is nervous."], "Phenomenon": "Thomas is kind", "PossibleCause": "Thomas is lazy", "Label": "True"}
{"Premises": ["Sandy is confident", "Sandy is curious", "Sandy is angry"], "Rules": ["If a person is trustworthy and patient then this person is quiet.", "If a person is humorous then this person is calm.", "If a person is confident and friendly then this person is beautiful.", "If a person is humorous then this person is quiet.", "If a person is loyal and patient then this person is quiet.", "If a person is beautiful then this person is nervous.", "If a person is nervous and curious then this person is positive."], "Phenomenon": "Sandy is positive", "PossibleCause": "Sandy is friendly", "Label": "True"}
{"Premises": ["Betty is outgoing", "Betty is enthusiastic", "Betty is excited"], "Rules": ["If a person is angry then this person is calm.", "If a person is loyal and friendly then this person is shy.", "If a person is loyal then this person is friendly.", "If a person is calm and enthusiastic then this person is beautiful.", "If a person is loyal then this person is shy.", "If a person is responsible and brave then this person is mature.", "If a person is outgoing and patient then this person is angry."], "Phenomenon": "Betty is beautiful", "PossibleCause": "Betty is patient", "Label": "True"}
{"Premises": ["Paul is lazy", "Paul is wise", "Paul is happy"], "Rules": ["If a person is careless then this person is careless.", "If a person is enthusiastic and wise then this person is kind.", "If a person is positive and positive then this person is friendly.", "If a person is calm then this person is enthusiastic.", "If a person is positive and careless then this person is humorous.", "If a person is responsible then this person is generous.", "If a person is lazy and creative then this person is calm."], "Phenomenon": "Paul is kind", "PossibleCause": "Paul is creative", "Label": "True"}
{"Premises": ["Lucy is outgoing", "Lucy is nervous", "Lucy is friendly"], "Rules": ["If a person is outgoing and beautiful then this person is calm.", "If a person is responsible then this person is confident.", "If a person is wise then this person is quiet.", "If a person is wise and careless then this person is confident.", "If a person is calm then this person is lazy.", "If a person is wise and confident then this person is confident.", "If a person is lazy and nervous then this person is intelligent."], "Phenomenon": "Lucy is intelligent", "PossibleCause": "Lucy is beautiful", "Label": "True"}
{"Premises": ["Thomas is curious", "Thomas is calm", "Thomas is humorous", "Jack is curious", "Jack is calm", "Jack is generous", "Jack is quiet"], "Rules": ["If a person is positive and nervous then this person is responsible.", "If a person is curious and beautiful then this person is loyal.", "If a person is enthusiastic then this person is nervous.", "If a person is loyal then this person is honest.", "If a person is patient then this person is nervous.", "If a person is honest and calm then this person is wise.", "If a person is patient and patient then this person is responsible."], "Phenomenon": "Thomas is wise", "PossibleCause": "Thomas is beautiful", "Label": "True"}
{"Premises": ["Helen is humorous", "Helen is happy", "Helen is patient"], "Rules": ["If a person is outgoing then this person is outgoing.", "If a person is excited then this person is responsible.", "If a person is humorous and lazy then this person is excited.", "If a person is outgoing then this person is outgoing.", "If a person is responsible and happy then this person is quiet.", "If a person is confident and trustworthy then this person is calm.", "If a person is shy and outgoing then this person is careless."], "Phenomenon": "Helen is quiet", "PossibleCause": "Helen is lazy", "Label": "True"}
{"Premises": ["Lisa is angry", "Lisa is wise", "Lisa is shy"], "Rules": ["If a person is angry and loyal then this person is enthusiastic.", "If a person is enthusiastic then this person is intelligent.", "If a person is responsible and calm then this person is kind.", "If a person is humorous then this person is creative.", "If a person is intelligent and wise then this person is patient.", "If a person is calm then this person is brave.", "If a person is beautiful and humorous then this person is kind."], "Phenomenon": "Lisa is patient", "PossibleCause": "Lisa is beautiful", "Label": "False"}
{"Premises": ["Sandy is trustworthy", "Sandy is outgoing", "Sandy is generous"], "Rules": ["If a person is curious then this person is honest.", "If a person is trustworthy and confident then this person is curious.", "If a person is friendly and brave then this person is enthusiastic.", "If a person is brave and positive then this person is positive.", "If a person is friendly then this person is excited.", "If a person is excited then this person is enthusiastic.", "If a person is honest and outgoing then this person is calm."], "Phenomenon": "Sandy is calm", "PossibleCause": "Sandy is confident", "Label": "True"}
{"Premises": ["David is nervous", "David is curious", "David is lazy"], "Rules": ["If a person is humorous and beautiful then this person is wise.", "If a person is nervous and confident then this person is honest.", "If a person is humorous then this person is careless.", "If a person is intelligent and wise then this person is wise.", "If a person is intelligent then this person is wise.", "If a person is quiet and curious then this person is patient.", "If a person is honest then this person is quiet."], "Phenomenon": "David is patient", "PossibleCause": "David is confident", "Label": "True"}
{"Premises": ["Grace is patient", "Grace is responsible", "Grace is angry"], "Rules": ["If a person is honest then this person is wise.", "If a person is lazy and wise then this person is nervous.", "If a person is intelligent and responsible then this person is friendly.", "If a person is wise then this person is loyal.", "If a person is quiet and trustworthy then this person is loyal.", "If a person is patient and shy then this person is excited.", "If a person is excited then this person is intelligent."], "Phenomenon": "Grace is friendly", "PossibleCause": "Grace is shy", "Label": "True"}
{"Premises": ["Paul is beautiful", "Paul is shy", "Paul is wise"], "Rules": ["If a person is nervous then this person is nervous.", "If a person is beautiful and humorous then this person is loyal.", "If a person is brave and shy then this person is mature.", "If a person is loyal then this person is brave.", "If a person is positive and calm then this person is creative.", "If a person is nervous then this person is nervous.", "If a person is positive and responsible then this person is creative."], "Phenomenon": "Paul is mature", "PossibleCause": "Paul is humorous", "Label": "True"}
