{"Premises": ["Justin is enthusiastic", "Justin is angry", "Paul is angry"], "Rules": ["If a person is creative then this person is patient.", "If a person is trustworthy and outgoing then this person is patient.", "If a person is lazy then this person is beautiful.", "If a person is creative and creative then this person is patient.", "If a person is enthusiastic and happy then this person is lazy.", "If a person is trustworthy then this person is patient."], "Phenomenon": "Justin is beautiful", "PossibleCause": "Justin is happy", "Label": "True"}
{"Premises": ["Peter is loyal", "Peter is enthusiastic"], "Rules": ["If a person is curious then this person is outgoing.", "If a person is creative then this person is nervous.", "If a person is curious then this person is outgoing.", "If a person is happy and happy then this person is responsible.", "If a person is shy and intelligent then this person is outgoing.", "If a person is loyal and wise then this person is creative."], "Phenomenon": "Peter is nervous", "PossibleCause": "Peter is wise", "Label": "True"}
{"Premises": ["Ted is calm", "Ted is intelligent", "Lisa is beautiful", "Lisa is patient"], "Rules": ["If a person is outgoing then this person is friendly.", "If a person is calm and beautiful then this person is loyal.", "If a person is nervous and enthusiastic then this person is positive.", "If a person is outgoing and enthusiastic then this person is positive.", "If a person is loyal then this person is honest.", "If a person is enthusiastic then this person is friendly."], "Phenomenon": "Ted is honest", "PossibleCause": "Ted is angry", "Label": "False"}
{"Premises": ["Paul is wise", "Paul is positive"], "Rules": ["If a person is trustworthy then this person is calm.", "If a person is loyal and loyal then this person is intelligent.", "If a person is wise and patient then this person is mature.", "If a person is loyal and calm then this person is outgoing.", "If a person is mature then this person is happy.", "If a person is responsible then this person is calm."], "Phenomenon": "Paul is happy", "PossibleCause": "Paul is patient", "Label": "True"}
{"Premises": ["Tom is honest", "Tom is nervous"], "Rules": ["If a person is honest and brave then this person is quiet.", "If a person is excited then this person is enthusiastic.", "If a person is quiet then this person is generous.", "If a person is curious and enthusiastic then this person is angry.", "If a person is trustworthy then this person is angry.", "If a person is curious and trustworthy then this person is intelligent."], "Phenomenon": "Tom is generous", "PossibleCause": "Tom is brave", "Label": "True"}
{"Premises": ["Grace is quiet", "Grace is wise"], "Rules": ["If a person is quiet and lazy then this person is positive.", "If a person is nervous and curious then this person is outgoing.", "If a person is nervous then this person is careless.", "If a person is positive then this person is beautiful.", "If a person is responsible and curious then this person is careless.", "If a person is patient then this person is friendly."], "Phenomenon": "Grace is beautiful", "PossibleCause": "Grace is lazy", "Label": "True"}
{"Premises": ["Betty is mature", "Betty is nervous"], "Rules": ["If a person is confident then this person is happy.", "If a person is trustworthy and beautiful then this person is beautiful.", "If a person is creative then this person is beautiful.", "If a person is mature and quiet then this person is confident.", "If a person is creative then this person is creative.", "If a person is patient and patient then this person is shy."], "Phenomenon": "Betty is happy", "PossibleCause": "Betty is trustworthy", "Label": "False"}
{"Premises": ["Betty is creative", "Betty is nervous"], "Rules": ["If a person is curious then this person is happy.", "If a person is curious and angry then this person is mature.", "If a person is creative and responsible then this person is wise.", "If a person is careless then this person is humorous.", "If a person is wise then this person is enthusiastic.", "If a person is angry and beautiful then this person is mature."], "Phenomenon": "Betty is enthusiastic", "PossibleCause": "Betty is responsible", "Label": "True"}
{"Premises": ["Denis is honest", "Denis is angry"], "Rules": ["If a person is responsible then this person is lazy.", "If a person is quiet then this person is positive.", "If a person is honest and patient then this person is responsible.", "If a person is quiet and generous then this person is loyal.", "If a person is generous then this person is loyal.", "If a person is generous and generous then this person is curious."], "Phenomenon": "Denis is lazy", "PossibleCause": "Denis is patient", "Label": "True"}
{"Premises": ["Peter is responsible", "Peter is curious"], "Rules": ["If a person is brave then this person is brave.", "If a person is responsible and angry then this person is intelligent.", "If a person is brave then this person is happy.", "If a person is enthusiastic and happy then this person is quiet.", "If a person is honest and brave then this person is happy.", "If a person is intelligent then this person is loyal."], "Phenomenon": "Peter is loyal", "PossibleCause": "Peter is angry", "Label": "True"}
{"Premises": ["Mark is confident", "Mark is generous"], "Rules": ["If a person is lazy and excited then this person is kind.", "If a person is humorous then this person is trustworthy.", "If a person is lazy then this person is excited.", "If a person is confident and enthusiastic then this person is positive.", "If a person is positive then this person is brave.", "If a person is lazy and trustworthy then this person is mature."], "Phenomenon": "Mark is brave", "PossibleCause": "Mark is lazy", "Label": "False"}
{"Premises": ["Anne is enthusiastic", "Anne is intelligent", "Lisa is quiet", "Lisa is intelligent", "Lisa is confident"], "Rules": ["If a person is outgoing then this person is calm.", "If a person is outgoing then this person is friendly.", "If a person is beautiful and beautiful then this person is kind.", "If a person is curious then this person is quiet.", "If a person is outgoing and friendly then this person is friendly.", "If a person is enthusiastic and angry then this person is curious."], "Phenomenon": "Anne is quiet", "PossibleCause": "Anne is angry", "Label": "True"}
{"Premises": ["James is curious", "James is quiet"], "Rules": ["If a person is wise and intelligent then this person is intelligent.", "If a person is happy and intelligent then this person is intelligent.", "If a person is confident then this person is intelligent.", "If a person is confident then this person is lazy.", "If a person is curious and trustworthy then this person is generous.", "If a person is generous then this person is patient."], "Phenomenon": "James is patient", "PossibleCause": "James is trustworthy", "Label": "True"}
{"Premises": ["Peter is honest", "Peter is kind"], "Rules": ["If a person is beautiful and generous then this person is generous.", "If a person is wise then this person is brave.", "If a person is honest and humorous then this person is happy.", "If a person is beautiful and lazy then this person is brave.", "If a person is trustworthy then this person is generous.", "If a person is happy then this person is angry."], "Phenomenon": "Peter is angry", "PossibleCause": "Peter is humorous", "Label": "True"}
{"Premises": ["Adam is friendly", "Adam is nervous"], "Rules": ["If a person is beautiful and kind then this person is humorous.", "If a person is patient then this person is patient.", "If a person is friendly and excited then this person is confident.", "If a person is trustworthy and patient then this person is generous.", "If a person is confident then this person is mature.", "If a person is happy then this person is generous."], "Phenomenon": "Adam is mature", "PossibleCause": "Adam is excited", "Label": "True"}
{"Premises": ["\nRobert is careless", "\nRobert is happy\n"], "Rules": ["If a person is careless and loyal then this person is nervous.", "If a person is excited then this person is shy.", "If a person is creative then this person is shy.", "If a person is nervous then this person is beautiful.", "If a person is intelligent and patient then this person is shy.", "If a person is intelligent and excited then this person is curious."], "Phenomenon": "Robert is beautiful", "PossibleCause": "Robert is loyal", "Label": "True"}
{"Premises": ["\nThomas is enthusiastic", "Thomas is brave"], "Rules": ["If a person is positive and positive then this person is intelligent.", "If a person is mature then this person is outgoing.", "If a person is enthusiastic and beautiful then this person is quiet.", "If a person is outgoing then this person is outgoing.", "If a person is mature and positive then this person is intelligent.", "If a person is quiet then this person is careless."], "Phenomenon": "Thomas is careless", "PossibleCause": "Thomas is mature", "Label": "False"}
{"Premises": ["Helen is friendly", "Helen is trustworthy"], "Rules": ["If a person is shy then this person is shy.", "If a person is nervous and shy then this person is excited.", "If a person is patient and nervous then this person is creative.", "If a person is lazy then this person is mature.", "If a person is friendly and kind then this person is lazy.", "If a person is nervous then this person is curious."], "Phenomenon": "Helen is mature", "PossibleCause": "Helen is kind", "Label": "True"}
{"Premises": ["Jessica is outgoing", "Jessica is quiet"], "Rules": ["If a person is enthusiastic and angry then this person is generous.", "If a person is enthusiastic and enthusiastic then this person is shy.", "If a person is outgoing and careless then this person is wise.", "If a person is wise then this person is nervous.", "If a person is calm then this person is angry.", "If a person is angry then this person is patient."], "Phenomenon": "Jessica is nervous", "PossibleCause": "Jessica is careless", "Label": "True"}
{"Premises": ["Lisa is humorous", "Lisa is outgoing"], "Rules": ["If a person is patient then this person is responsible.", "If a person is intelligent and brave then this person is quiet.", "If a person is confident and creative then this person is positive.", "If a person is nervous then this person is nervous.", "If a person is humorous and wise then this person is patient.", "If a person is nervous then this person is nervous."], "Phenomenon": "Lisa is responsible", "PossibleCause": "Lisa is wise", "Label": "True"}
{"Premises": ["Paul is happy", "Paul is loyal"], "Rules": ["If a person is nervous and wise then this person is lazy.", "If a person is calm then this person is lazy.", "If a person is curious and wise then this person is wise.", "If a person is mature then this person is quiet.", "If a person is curious then this person is lazy.", "If a person is happy and shy then this person is mature."], "Phenomenon": "Paul is quiet", "PossibleCause": "Paul is shy", "Label": "True"}
{"Premises": ["Justin is mature", "Justin is confident"], "Rules": ["If a person is patient and lazy then this person is kind.", "If a person is mature and shy then this person is trustworthy.", "If a person is humorous then this person is honest.", "If a person is humorous and honest then this person is kind.", "If a person is trustworthy then this person is generous.", "If a person is humorous then this person is lazy."], "Phenomenon": "Justin is generous", "PossibleCause": "Justin is shy", "Label": "True"}
{"Premises": ["Mark is confident", "Mark is positive"], "Rules": ["If a person is responsible then this person is shy.", "If a person is lazy and intelligent then this person is calm.", "If a person is confident and excited then this person is responsible.", "If a person is lazy then this person is intelligent.", "If a person is lazy and happy then this person is calm.", "If a person is lazy then this person is generous."], "Phenomenon": "Mark is shy", "PossibleCause": "Mark is excited", "Label": "True"}
{"Premises": ["Peter is enthusiastic", "Peter is excited"], "Rules": ["If a person is creative and creative then this person is brave.", "If a person is enthusiastic and friendly then this person is quiet.", "If a person is quiet then this person is lazy.", "If a person is wise then this person is brave.", "If a person is creative then this person is patient.", "If a person is creative and kind then this person is confident."], "Phenomenon": "Peter is lazy", "PossibleCause": "Peter is wise", "Label": "False"}
{"Premises": ["Lucy is nervous", "Lucy is trustworthy"], "Rules": ["If a person is excited then this person is calm.", "If a person is intelligent then this person is positive.", "If a person is nervous and lazy then this person is intelligent.", "If a person is confident and confident then this person is kind.", "If a person is confident and excited then this person is calm.", "If a person is confident then this person is excited."], "Phenomenon": "Lucy is positive", "PossibleCause": "Lucy is lazy", "Label": "True"}
{"Premises": ["Tom is friendly", "Tom is curious"], "Rules": ["If a person is beautiful then this person is confident.", "If a person is loyal and lazy then this person is shy.", "If a person is loyal then this person is calm.", "If a person is friendly and careless then this person is beautiful.", "If a person is outgoing and calm then this person is trustworthy.", "If a person is lazy then this person is calm."], "Phenomenon": "Tom is confident", "PossibleCause": "Tom is careless", "Label": "True"}
{"Premises": ["Mark is kind", "Mark is nervous"], "Rules": ["If a person is angry and beautiful then this person is curious.", "If a person is happy then this person is curious.", "If a person is kind and outgoing then this person is positive.", "If a person is happy then this person is trustworthy.", "If a person is positive then this person is wise.", "If a person is excited and curious then this person is trustworthy."], "Phenomenon": "Mark is wise", "PossibleCause": "Mark is angry", "Label": "False"}
{"Premises": ["Eric is careless", "Eric is responsible"], "Rules": ["If a person is quiet then this person is lazy.", "If a person is kind and happy then this person is calm.", "If a person is beautiful and happy then this person is excited.", "If a person is kind then this person is friendly.", "If a person is careless and positive then this person is quiet.", "If a person is angry then this person is friendly."], "Phenomenon": "Eric is lazy", "PossibleCause": "Eric is positive", "Label": "True"}
{"Premises": ["Denis is beautiful", "Denis is careless"], "Rules": ["If a person is quiet and generous then this person is enthusiastic.", "If a person is trustworthy then this person is generous.", "If a person is quiet and generous then this person is enthusiastic.", "If a person is quiet then this person is generous.", "If a person is beautiful and positive then this person is intelligent.", "If a person is intelligent then this person is friendly."], "Phenomenon": "Denis is friendly", "PossibleCause": "Denis is positive", "Label": "True"}
{"Premises": ["Ted is kind", "Ted is positive"], "Rules": ["If a person is mature then this person is angry.", "If a person is mature then this person is angry.", "If a person is loyal then this person is curious.", "If a person is mature and beautiful then this person is brave.", "If a person is trustworthy and mature then this person is angry.", "If a person is kind and confident then this person is loyal."], "Phenomenon": "Ted is curious", "PossibleCause": "Ted is confident", "Label": "True"}
{"Premises": ["Anne is honest", "Anne is quiet"], "Rules": ["If a person is confident then this person is responsible.", "If a person is confident then this person is responsible.", "If a person is lazy and confident then this person is mature.", "If a person is happy then this person is patient.", "If a person is honest and humorous then this person is happy.", "If a person is lazy and mature then this person is mature."], "Phenomenon": "Anne is patient", "PossibleCause": "Anne is humorous", "Label": "True"}
{"Premises": ["Jane is trustworthy", "Jane is shy"], "Rules": ["If a person is beautiful then this person is generous.", "If a person is confident and beautiful then this person is outgoing.", "If a person is lazy then this person is nervous.", "If a person is confident and beautiful then this person is generous.", "If a person is confident then this person is patient.", "If a person is trustworthy and responsible then this person is lazy."], "Phenomenon": "Jane is nervous", "PossibleCause": "Jane is responsible", "Label": "True"}
{"Premises": ["Robert is confident", "Robert is lazy"], "Rules": ["If a person is curious and positive then this person is wise.", "If a person is trustworthy then this person is excited.", "If a person is honest then this person is careless.", "If a person is beautiful and positive then this person is angry.", "If a person is confident and intelligent then this person is honest.", "If a person is positive then this person is trustworthy."], "Phenomenon": "Robert is careless", "PossibleCause": "Robert is intelligent", "Label": "True"}
{"Premises": ["Adam is patient", "Adam is nervous"], "Rules": ["If a person is humorous then this person is excited.", "If a person is outgoing and excited then this person is angry.", "If a person is patient and kind then this person is careless.", "If a person is careless then this person is brave.", "If a person is humorous then this person is angry.", "If a person is humorous and loyal then this person is trustworthy."], "Phenomenon": "Adam is brave", "PossibleCause": "Adam is kind", "Label": "True"}
{"Premises": ["Helen is excited", "Helen is responsible"], "Rules": ["If a person is intelligent then this person is calm.", "If a person is confident then this person is curious.", "If a person is creative and creative then this person is wise.", "If a person is creative and confident then this person is curious.", "If a person is excited and angry then this person is intelligent.", "If a person is mature then this person is curious."], "Phenomenon": "Helen is calm", "PossibleCause": "Helen is humorous", "Label": "False"}
{"Premises": ["Adam is kind", "Adam is careless"], "Rules": ["If a person is generous then this person is patient.", "If a person is curious and outgoing then this person is trustworthy.", "If a person is outgoing then this person is brave.", "If a person is kind and beautiful then this person is generous.", "If a person is mature and mature then this person is trustworthy.", "If a person is curious then this person is outgoing."], "Phenomenon": "Adam is patient", "PossibleCause": "Adam is beautiful", "Label": "True"}
{"Premises": ["Gary is lazy", "Gary is curious"], "Rules": ["If a person is creative then this person is excited.", "If a person is calm then this person is humorous.", "If a person is lazy and outgoing then this person is calm.", "If a person is creative and generous then this person is brave.", "If a person is beautiful and generous then this person is patient.", "If a person is generous then this person is excited."], "Phenomenon": "Gary is humorous", "PossibleCause": "Gary is outgoing", "Label": "True"}
{"Premises": ["Paul is curious", "Paul is brave"], "Rules": ["If a person is curious and loyal then this person is creative.", "If a person is friendly then this person is lazy.", "If a person is friendly and outgoing then this person is happy.", "If a person is wise and friendly then this person is happy.", "If a person is creative then this person is shy.", "If a person is kind then this person is outgoing."], "Phenomenon": "Paul is shy", "PossibleCause": "Paul is loyal", "Label": "True"}
{"Premises": ["Robin is curious", "Robin is mature"], "Rules": ["If a person is wise and creative then this person is angry.", "If a person is wise then this person is creative.", "If a person is wise then this person is brave.", "If a person is curious and kind then this person is loyal.", "If a person is loyal then this person is nervous.", "If a person is patient and creative then this person is creative."], "Phenomenon": "Robin is nervous", "PossibleCause": "Robin is kind", "Label": "True"}
{"Premises": ["Thomas is careless", "Thomas is brave"], "Rules": ["If a person is careless and humorous then this person is happy.", "If a person is curious then this person is friendly.", "If a person is friendly then this person is angry.", "If a person is happy then this person is enthusiastic.", "If a person is curious and generous then this person is angry.", "If a person is generous and generous then this person is angry."], "Phenomenon": "Thomas is enthusiastic", "PossibleCause": "Thomas is humorous", "Label": "True"}
{"Premises": ["Jane is kind", "Jane is shy"], "Rules": ["If a person is happy then this person is patient.", "If a person is angry and confident then this person is patient.", "If a person is kind and excited then this person is positive.", "If a person is angry then this person is quiet.", "If a person is positive then this person is mature.", "If a person is confident and confident then this person is wise."], "Phenomenon": "Jane is mature", "PossibleCause": "Jane is excited", "Label": "True"}
{"Premises": ["Thomas is quiet", "Thomas is angry"], "Rules": ["If a person is outgoing then this person is careless.", "If a person is confident and intelligent then this person is creative.", "If a person is confident and positive then this person is positive.", "If a person is confident then this person is positive.", "If a person is confident then this person is positive.", "If a person is quiet and kind then this person is outgoing."], "Phenomenon": "Thomas is careless", "PossibleCause": "Thomas is kind", "Label": "True"}
{"Premises": ["Robert is nervous", "Robert is patient"], "Rules": ["If a person is angry then this person is enthusiastic.", "If a person is nervous and happy then this person is calm.", "If a person is loyal and angry then this person is wise.", "If a person is loyal and wise then this person is enthusiastic.", "If a person is loyal then this person is enthusiastic.", "If a person is calm then this person is kind."], "Phenomenon": "Robert is kind", "PossibleCause": "Robert is happy", "Label": "True"}
{"Premises": ["Peter is angry", "Peter is calm"], "Rules": ["If a person is shy then this person is careless.", "If a person is angry and intelligent then this person is shy.", "If a person is generous and trustworthy then this person is brave.", "If a person is trustworthy then this person is brave.", "If a person is trustworthy then this person is brave.", "If a person is confident and happy then this person is honest."], "Phenomenon": "Peter is careless", "PossibleCause": "Peter is intelligent", "Label": "True"}
{"Premises": ["Sandy is calm", "Sandy is patient"], "Rules": ["If a person is wise and nervous then this person is careless.", "If a person is wise and positive then this person is generous.", "If a person is mature then this person is quiet.", "If a person is positive then this person is careless.", "If a person is calm and brave then this person is mature.", "If a person is wise then this person is careless."], "Phenomenon": "Sandy is quiet", "PossibleCause": "Sandy is brave", "Label": "True"}
{"Premises": ["Sandy is quiet", "Sandy is patient"], "Rules": ["If a person is mature then this person is confident.", "If a person is quiet and calm then this person is beautiful.", "If a person is shy and shy then this person is friendly.", "If a person is excited and lazy then this person is kind.", "If a person is beautiful then this person is careless.", "If a person is mature then this person is lazy."], "Phenomenon": "Sandy is careless", "PossibleCause": "Sandy is calm", "Label": "True"}
{"Premises": ["Lucy is curious", "Lucy is confident"], "Rules": ["If a person is outgoing then this person is outgoing.", "If a person is curious and friendly then this person is intelligent.", "If a person is brave and calm then this person is patient.", "If a person is lazy then this person is quiet.", "If a person is lazy and outgoing then this person is calm.", "If a person is intelligent then this person is loyal."], "Phenomenon": "Lucy is loyal", "PossibleCause": "Lucy is friendly", "Label": "True"}
{"Premises": ["Jane is honest", "Jane is enthusiastic"], "Rules": ["If a person is calm then this person is shy.", "If a person is generous then this person is responsible.", "If a person is honest and mature then this person is generous.", "If a person is calm then this person is excited.", "If a person is lazy and lazy then this person is wise.", "If a person is brave and excited then this person is wise."], "Phenomenon": "Jane is responsible", "PossibleCause": "Jane is mature", "Label": "True"}
{"Premises": ["Jack is nervous", "Jack is outgoing"], "Rules": ["If a person is wise then this person is curious.", "If a person is beautiful and wise then this person is intelligent.", "If a person is careless then this person is intelligent.", "If a person is wise and wise then this person is curious.", "If a person is calm then this person is creative.", "If a person is nervous and responsible then this person is calm."], "Phenomenon": "Jack is creative", "PossibleCause": "Jack is responsible", "Label": "True"}
{"Premises": ["Denis is kind", "Denis is calm"], "Rules": ["If a person is beautiful and happy then this person is humorous.", "If a person is curious then this person is patient.", "If a person is trustworthy and curious then this person is careless.", "If a person is kind and shy then this person is intelligent.", "If a person is happy then this person is patient.", "If a person is intelligent then this person is responsible."], "Phenomenon": "Denis is responsible", "PossibleCause": "Denis is shy", "Label": "True"}
{"Premises": ["Justin is nervous", "Justin is angry"], "Rules": ["If a person is quiet then this person is confident.", "If a person is patient and humorous then this person is brave.", "If a person is shy then this person is generous.", "If a person is nervous and creative then this person is quiet.", "If a person is trustworthy then this person is generous.", "If a person is happy and happy then this person is humorous."], "Phenomenon": "Justin is confident", "PossibleCause": "Justin is creative", "Label": "True"}
{"Premises": ["Mark is trustworthy", "Mark is shy"], "Rules": ["If a person is humorous and lazy then this person is friendly.", "If a person is responsible and confident then this person is enthusiastic.", "If a person is trustworthy and honest then this person is careless.", "If a person is humorous then this person is lazy.", "If a person is humorous then this person is wise.", "If a person is careless then this person is nervous."], "Phenomenon": "Mark is nervous", "PossibleCause": "Mark is honest", "Label": "True"}
{"Premises": ["Helen is quiet", "Helen is calm"], "Rules": ["If a person is generous then this person is nervous.", "If a person is confident and humorous then this person is brave.", "If a person is confident then this person is brave.", "If a person is quiet and wise then this person is generous.", "If a person is patient and brave then this person is curious.", "If a person is humorous then this person is brave."], "Phenomenon": "Helen is nervous", "PossibleCause": "Helen is wise", "Label": "True"}
{"Premises": ["Lisa is angry", "Lisa is intelligent"], "Rules": ["If a person is beautiful then this person is loyal.", "If a person is quiet and loyal then this person is loyal.", "If a person is brave then this person is honest.", "If a person is angry and friendly then this person is brave.", "If a person is quiet then this person is nervous.", "If a person is quiet and outgoing then this person is curious."], "Phenomenon": "Lisa is honest", "PossibleCause": "Lisa is beautiful", "Label": "False"}
{"Premises": ["Betty is careless", "Betty is responsible"], "Rules": ["If a person is confident and nervous then this person is humorous.", "If a person is nervous then this person is humorous.", "If a person is loyal and nervous then this person is brave.", "If a person is enthusiastic then this person is calm.", "If a person is careless and curious then this person is enthusiastic.", "If a person is confident then this person is humorous."], "Phenomenon": "Betty is calm", "PossibleCause": "Betty is loyal", "Label": "False"}
{"Premises": ["Tom is loyal", "Tom is calm"], "Rules": ["If a person is creative and outgoing then this person is angry.", "If a person is loyal and enthusiastic then this person is humorous.", "If a person is humorous then this person is honest.", "If a person is intelligent then this person is angry.", "If a person is intelligent and lazy then this person is friendly.", "If a person is intelligent then this person is angry."], "Phenomenon": "Tom is honest", "PossibleCause": "Tom is enthusiastic", "Label": "True"}
{"Premises": ["Denis is humorous", "Denis is mature"], "Rules": ["If a person is angry and lazy then this person is nervous.", "If a person is beautiful and nervous then this person is careless.", "If a person is lazy then this person is quiet.", "If a person is trustworthy then this person is friendly.", "If a person is humorous and enthusiastic then this person is trustworthy.", "If a person is calm then this person is quiet."], "Phenomenon": "Denis is friendly", "PossibleCause": "Denis is enthusiastic", "Label": "True"}
{"Premises": ["Thomas is intelligent", "Thomas is responsible"], "Rules": ["If a person is honest then this person is enthusiastic.", "If a person is happy then this person is honest.", "If a person is happy and honest then this person is wise.", "If a person is intelligent and beautiful then this person is loyal.", "If a person is lazy and friendly then this person is wise.", "If a person is loyal then this person is angry."], "Phenomenon": "Thomas is angry", "PossibleCause": "Thomas is happy", "Label": "False"}
{"Premises": ["Eric is intelligent", "Eric is enthusiastic"], "Rules": ["If a person is creative and lazy then this person is curious.", "If a person is creative and patient then this person is curious.", "If a person is intelligent and trustworthy then this person is honest.", "If a person is honest then this person is positive.", "If a person is responsible then this person is curious.", "If a person is lazy then this person is patient."], "Phenomenon": "Eric is positive", "PossibleCause": "Eric is trustworthy", "Label": "True"}
{"Premises": ["Justin is positive", "Justin is nervous"], "Rules": ["If a person is generous then this person is intelligent.", "If a person is lazy and confident then this person is creative.", "If a person is positive and humorous then this person is generous.", "If a person is lazy then this person is confident.", "If a person is shy and shy then this person is friendly.", "If a person is confident then this person is beautiful."], "Phenomenon": "Justin is intelligent", "PossibleCause": "Justin is humorous", "Label": "True"}
{"Premises": ["Gary is intelligent", "Gary is generous"], "Rules": ["If a person is responsible then this person is humorous.", "If a person is creative then this person is brave.", "If a person is patient and patient then this person is honest.", "If a person is shy then this person is brave.", "If a person is intelligent and kind then this person is responsible.", "If a person is creative and positive then this person is honest."], "Phenomenon": "Gary is humorous", "PossibleCause": "Gary is kind", "Label": "True"}
{"Premises": ["Grace is enthusiastic", "Grace is responsible"], "Rules": ["If a person is generous then this person is kind.", "If a person is angry then this person is curious.", "If a person is enthusiastic and mature then this person is angry.", "If a person is generous and beautiful then this person is friendly.", "If a person is trustworthy and beautiful then this person is friendly.", "If a person is trustworthy then this person is quiet."], "Phenomenon": "Grace is curious", "PossibleCause": "Grace is mature", "Label": "True"}
{"Premises": ["Denis is confident", "Denis is nervous"], "Rules": ["If a person is quiet then this person is quiet.", "If a person is curious then this person is humorous.", "If a person is happy and enthusiastic then this person is humorous.", "If a person is confident and beautiful then this person is outgoing.", "If a person is outgoing then this person is brave.", "If a person is happy and quiet then this person is enthusiastic."], "Phenomenon": "Denis is brave", "PossibleCause": "Denis is beautiful", "Label": "True"}
{"Premises": ["Peter is loyal", "Peter is curious"], "Rules": ["If a person is quiet and honest then this person is friendly.", "If a person is quiet and trustworthy then this person is honest.", "If a person is patient then this person is trustworthy.", "If a person is careless then this person is excited.", "If a person is trustworthy then this person is trustworthy.", "If a person is loyal and creative then this person is careless."], "Phenomenon": "Peter is excited", "PossibleCause": "Peter is creative", "Label": "True"}
{"Premises": ["Lucy is honest", "Lucy is confident"], "Rules": ["If a person is honest and nervous then this person is trustworthy.", "If a person is trustworthy then this person is enthusiastic.", "If a person is lazy then this person is excited.", "If a person is friendly and loyal then this person is humorous.", "If a person is lazy then this person is lazy.", "If a person is friendly and lazy then this person is excited."], "Phenomenon": "Lucy is enthusiastic", "PossibleCause": "Lucy is nervous", "Label": "True"}
{"Premises": ["Jane is wise", "Jane is mature"], "Rules": ["If a person is nervous and humorous then this person is humorous.", "If a person is creative then this person is curious.", "If a person is wise and responsible then this person is creative.", "If a person is nervous and patient then this person is outgoing.", "If a person is nervous then this person is outgoing.", "If a person is positive then this person is patient."], "Phenomenon": "Jane is curious", "PossibleCause": "Jane is responsible", "Label": "True"}
{"Premises": ["Lisa is curious", "Lisa is humorous"], "Rules": ["If a person is intelligent and mature then this person is mature.", "If a person is curious and positive then this person is generous.", "If a person is enthusiastic and loyal then this person is mature.", "If a person is intelligent then this person is mature.", "If a person is generous then this person is friendly.", "If a person is enthusiastic then this person is quiet."], "Phenomenon": "Lisa is friendly", "PossibleCause": "Lisa is positive", "Label": "True"}
{"Premises": ["Jack is outgoing", "Jack is happy"], "Rules": ["If a person is humorous then this person is calm.", "If a person is outgoing and responsible then this person is friendly.", "If a person is friendly then this person is generous.", "If a person is calm then this person is calm.", "If a person is humorous and creative then this person is mature.", "If a person is intelligent and calm then this person is mature."], "Phenomenon": "Jack is generous", "PossibleCause": "Jack is responsible", "Label": "True"}
{"Premises": ["Grace is beautiful", "Grace is creative"], "Rules": ["If a person is wise then this person is lazy.", "If a person is careless then this person is wise.", "If a person is excited then this person is angry.", "If a person is mature and wise then this person is lazy.", "If a person is beautiful and humorous then this person is excited.", "If a person is mature and calm then this person is lazy."], "Phenomenon": "Grace is angry", "PossibleCause": "Grace is mature", "Label": "False"}
{"Premises": ["James is brave", "James is patient"], "Rules": ["If a person is mature then this person is intelligent.", "If a person is nervous then this person is nervous.", "If a person is happy then this person is curious.", "If a person is honest and mature then this person is intelligent.", "If a person is honest and intelligent then this person is intelligent.", "If a person is brave and humorous then this person is happy."], "Phenomenon": "James is curious", "PossibleCause": "James is confident", "Label": "False"}
{"Premises": ["Lisa is humorous", "Lisa is loyal"], "Rules": ["If a person is humorous and generous then this person is enthusiastic.", "If a person is confident then this person is positive.", "If a person is confident and careless then this person is friendly.", "If a person is confident and positive then this person is friendly.", "If a person is kind then this person is friendly.", "If a person is enthusiastic then this person is intelligent."], "Phenomenon": "Lisa is intelligent", "PossibleCause": "Lisa is generous", "Label": "True"}
{"Premises": ["Grace is creative", "Grace is excited"], "Rules": ["If a person is trustworthy then this person is honest.", "If a person is intelligent then this person is intelligent.", "If a person is creative and confident then this person is trustworthy.", "If a person is curious and quiet then this person is shy.", "If a person is lazy then this person is quiet.", "If a person is lazy and intelligent then this person is quiet."], "Phenomenon": "Grace is honest", "PossibleCause": "Grace is responsible", "Label": "False"}
{"Premises": ["Paul is kind", "Paul is responsible"], "Rules": ["If a person is creative then this person is enthusiastic.", "If a person is happy then this person is humorous.", "If a person is honest and outgoing then this person is brave.", "If a person is kind and shy then this person is creative.", "If a person is honest then this person is outgoing.", "If a person is confident and excited then this person is brave."], "Phenomenon": "Paul is enthusiastic", "PossibleCause": "Paul is happy", "Label": "False"}
{"Premises": ["David is calm", "David is positive"], "Rules": ["If a person is careless then this person is quiet.", "If a person is responsible then this person is wise.", "If a person is brave and confident then this person is happy.", "If a person is careless then this person is careless.", "If a person is brave and trustworthy then this person is quiet.", "If a person is calm and honest then this person is responsible."], "Phenomenon": "David is wise", "PossibleCause": "David is honest", "Label": "True"}
{"Premises": ["Thomas is kind", "Thomas is shy"], "Rules": ["If a person is mature then this person is generous.", "If a person is happy and friendly then this person is generous.", "If a person is responsible then this person is enthusiastic.", "If a person is excited then this person is wise.", "If a person is kind and curious then this person is excited.", "If a person is happy and generous then this person is angry."], "Phenomenon": "Thomas is wise", "PossibleCause": "Thomas is curious", "Label": "True"}
{"Premises": ["Bob is happy", "Bob is friendly"], "Rules": ["If a person is intelligent then this person is curious.", "If a person is beautiful and creative then this person is creative.", "If a person is brave and creative then this person is generous.", "If a person is happy and careless then this person is confident.", "If a person is curious then this person is curious.", "If a person is confident then this person is lazy."], "Phenomenon": "Bob is lazy", "PossibleCause": "Bob is careless", "Label": "True"}
{"Premises": ["Gary is patient", "Gary is shy"], "Rules": ["If a person is careless then this person is loyal.", "If a person is kind and kind then this person is excited.", "If a person is beautiful then this person is enthusiastic.", "If a person is calm and enthusiastic then this person is quiet.", "If a person is patient and curious then this person is careless.", "If a person is calm then this person is generous."], "Phenomenon": "Gary is loyal", "PossibleCause": "Gary is curious", "Label": "True"}
{"Premises": ["Justin is humorous", "Justin is beautiful"], "Rules": ["If a person is humorous and quiet then this person is generous.", "If a person is nervous and responsible then this person is wise.", "If a person is friendly then this person is wise.", "If a person is enthusiastic and friendly then this person is shy.", "If a person is generous then this person is excited.", "If a person is responsible then this person is friendly."], "Phenomenon": "Justin is excited", "PossibleCause": "Justin is quiet", "Label": "True"}
{"Premises": ["Robert is friendly", "Robert is nervous"], "Rules": ["If a person is quiet then this person is lazy.", "If a person is quiet and lazy then this person is patient.", "If a person is creative then this person is mature.", "If a person is enthusiastic and patient then this person is patient.", "If a person is friendly and shy then this person is creative.", "If a person is quiet then this person is angry."], "Phenomenon": "Robert is mature", "PossibleCause": "Robert is shy", "Label": "True"}
{"Premises": ["\nSandy is curious", "Sandy is careless"], "Rules": ["If a person is confident then this person is calm.", "If a person is positive then this person is loyal.", "If a person is shy and shy then this person is calm.", "If a person is shy then this person is calm.", "If a person is confident and calm then this person is calm.", "If a person is curious and generous then this person is positive."], "Phenomenon": "Sandy is loyal", "PossibleCause": "Sandy is generous", "Label": "True"}
{"Premises": ["James is wise", "James is brave"], "Rules": ["If a person is outgoing then this person is nervous.", "If a person is wise and patient then this person is angry.", "If a person is angry then this person is mature.", "If a person is outgoing and quiet then this person is shy.", "If a person is outgoing and quiet then this person is shy.", "If a person is positive then this person is generous."], "Phenomenon": "James is mature", "PossibleCause": "James is patient", "Label": "True"}
{"Premises": ["Lucy is humorous", "Lucy is positive"], "Rules": ["If a person is honest then this person is brave.", "If a person is humorous and careless then this person is quiet.", "If a person is angry then this person is brave.", "If a person is quiet then this person is trustworthy.", "If a person is honest and brave then this person is intelligent.", "If a person is confident and honest then this person is brave."], "Phenomenon": "Lucy is trustworthy", "PossibleCause": "Lucy is angry", "Label": "False"}
{"Premises": ["David is shy", "David is outgoing"], "Rules": ["If a person is enthusiastic then this person is quiet.", "If a person is enthusiastic then this person is happy.", "If a person is enthusiastic and quiet then this person is lazy.", "If a person is shy and honest then this person is intelligent.", "If a person is curious and positive then this person is happy.", "If a person is intelligent then this person is mature."], "Phenomenon": "David is mature", "PossibleCause": "David is kind", "Label": "False"}
{"Premises": ["Justin is trustworthy", "Justin is wise"], "Rules": ["If a person is nervous and happy then this person is shy.", "If a person is positive then this person is excited.", "If a person is positive then this person is shy.", "If a person is friendly then this person is beautiful.", "If a person is trustworthy and careless then this person is friendly.", "If a person is happy and curious then this person is calm."], "Phenomenon": "Justin is beautiful", "PossibleCause": "Justin is careless", "Label": "True"}
{"Premises": ["Grace is patient", "Grace is excited"], "Rules": ["If a person is angry then this person is quiet.", "If a person is mature and mature then this person is curious.", "If a person is loyal then this person is curious.", "If a person is loyal then this person is curious.", "If a person is patient and friendly then this person is angry.", "If a person is mature and mature then this person is trustworthy."], "Phenomenon": "Grace is quiet", "PossibleCause": "Grace is friendly", "Label": "True"}
{"Premises": ["Helen is creative", "Helen is quiet"], "Rules": ["If a person is intelligent then this person is careless.", "If a person is wise and enthusiastic then this person is friendly.", "If a person is excited then this person is friendly.", "If a person is creative and responsible then this person is intelligent.", "If a person is wise and enthusiastic then this person is friendly.", "If a person is enthusiastic then this person is humorous."], "Phenomenon": "Helen is careless", "PossibleCause": "Helen is responsible", "Label": "True"}
{"Premises": ["Helen is angry", "Helen is wise"], "Rules": ["If a person is generous then this person is creative.", "If a person is outgoing then this person is beautiful.", "If a person is lazy and outgoing then this person is happy.", "If a person is friendly and friendly then this person is beautiful.", "If a person is brave then this person is outgoing.", "If a person is angry and mature then this person is generous."], "Phenomenon": "Helen is creative", "PossibleCause": "Helen is mature", "Label": "True"}
{"Premises": ["Jane is calm", "Jane is loyal"], "Rules": ["If a person is outgoing then this person is responsible.", "If a person is kind then this person is lazy.", "If a person is happy and honest then this person is honest.", "If a person is calm and beautiful then this person is outgoing.", "If a person is angry then this person is careless.", "If a person is happy and angry then this person is lazy."], "Phenomenon": "Jane is responsible", "PossibleCause": "Jane is beautiful", "Label": "True"}
{"Premises": ["James is loyal", "James is honest"], "Rules": ["If a person is responsible and wise then this person is wise.", "If a person is friendly then this person is humorous.", "If a person is loyal and generous then this person is beautiful.", "If a person is beautiful then this person is mature.", "If a person is creative then this person is humorous.", "If a person is responsible and wise then this person is wise."], "Phenomenon": "James is mature", "PossibleCause": "James is generous", "Label": "True"}
{"Premises": ["David is beautiful", "David is positive"], "Rules": ["If a person is trustworthy and wise then this person is friendly.", "If a person is beautiful and patient then this person is careless.", "If a person is careless then this person is excited.", "If a person is honest and intelligent then this person is brave.", "If a person is wise then this person is kind.", "If a person is trustworthy then this person is intelligent."], "Phenomenon": "David is excited", "PossibleCause": "David is patient", "Label": "True"}
{"Premises": ["Helen is confident", "Helen is happy"], "Rules": ["If a person is nervous then this person is responsible.", "If a person is loyal and nervous then this person is calm.", "If a person is outgoing then this person is patient.", "If a person is nervous and responsible then this person is mature.", "If a person is confident and quiet then this person is outgoing.", "If a person is positive then this person is mature."], "Phenomenon": "Helen is patient", "PossibleCause": "Helen is quiet", "Label": "True"}
{"Premises": ["Tom is quiet", "Tom is mature"], "Rules": ["If a person is quiet and beautiful then this person is wise.", "If a person is friendly and angry then this person is humorous.", "If a person is angry then this person is positive.", "If a person is wise then this person is outgoing.", "If a person is angry then this person is curious.", "If a person is brave and angry then this person is curious."], "Phenomenon": "Tom is outgoing", "PossibleCause": "Tom is beautiful", "Label": "True"}
{"Premises": ["Anne is loyal", "Anne is excited", "Justin is angry", "Justin is excited"], "Rules": ["If a person is friendly then this person is happy.", "If a person is quiet and confident then this person is happy.", "If a person is positive then this person is angry.", "If a person is quiet and quiet then this person is confident.", "If a person is friendly then this person is confident.", "If a person is loyal and wise then this person is positive."], "Phenomenon": "Anne is angry", "PossibleCause": "Anne is wise", "Label": "True"}
{"Premises": ["Betty is shy", "Betty is beautiful"], "Rules": ["If a person is shy and creative then this person is loyal.", "If a person is confident then this person is enthusiastic.", "If a person is loyal then this person is angry.", "If a person is excited and positive then this person is calm.", "If a person is excited then this person is calm.", "If a person is confident and positive then this person is calm."], "Phenomenon": "Betty is angry", "PossibleCause": "Betty is creative", "Label": "True"}
{"Premises": ["Paul is calm", "Paul is honest"], "Rules": ["If a person is humorous then this person is kind.", "If a person is mature and generous then this person is generous.", "If a person is nervous then this person is outgoing.", "If a person is quiet and mature then this person is creative.", "If a person is intelligent then this person is intelligent.", "If a person is calm and brave then this person is humorous."], "Phenomenon": "Paul is kind", "PossibleCause": "Paul is brave", "Label": "True"}
{"Premises": ["Jessica is enthusiastic", "Jessica is patient"], "Rules": ["If a person is angry then this person is angry.", "If a person is excited and angry then this person is outgoing.", "If a person is excited and excited then this person is generous.", "If a person is enthusiastic and nervous then this person is honest.", "If a person is brave then this person is outgoing.", "If a person is honest then this person is lazy."], "Phenomenon": "Jessica is lazy", "PossibleCause": "Jessica is wise", "Label": "False"}
{"Premises": ["Bob is humorous", "Bob is loyal"], "Rules": ["If a person is creative then this person is honest.", "If a person is humorous and beautiful then this person is trustworthy.", "If a person is creative then this person is honest.", "If a person is positive and calm then this person is enthusiastic.", "If a person is trustworthy then this person is kind.", "If a person is creative and creative then this person is enthusiastic."], "Phenomenon": "Bob is kind", "PossibleCause": "Bob is beautiful", "Label": "True"}
{"Premises": ["Peter is wise", "Peter is mature"], "Rules": ["If a person is nervous and trustworthy then this person is beautiful.", "If a person is positive then this person is brave.", "If a person is nervous then this person is calm.", "If a person is nervous then this person is trustworthy.", "If a person is nervous and nervous then this person is lazy.", "If a person is wise and angry then this person is positive."], "Phenomenon": "Peter is brave", "PossibleCause": "Peter is patient", "Label": "False"}
{"Premises": ["Charles is enthusiastic", "Charles is confident"], "Rules": ["If a person is lazy and lazy then this person is quiet.", "If a person is lazy and calm then this person is quiet.", "If a person is lazy then this person is loyal.", "If a person is lazy then this person is creative.", "If a person is enthusiastic and curious then this person is friendly.", "If a person is friendly then this person is excited."], "Phenomenon": "Charles is excited", "PossibleCause": "Charles is curious", "Label": "True"}
{"Premises": ["Adam is generous", "Adam is humorous"], "Rules": ["If a person is shy and shy then this person is careless.", "If a person is generous and quiet then this person is calm.", "If a person is honest then this person is angry.", "If a person is calm then this person is outgoing.", "If a person is honest then this person is confident.", "If a person is honest and angry then this person is careless."], "Phenomenon": "Adam is outgoing", "PossibleCause": "Adam is loyal", "Label": "False"}
