{"Premises": ["Jessica is shy", "Jessica is calm", "Jessica is enthusiastic"], "Rules": ["If a person is mature and kind then this person is kind.", "If a person is confident then this person is kind.", "If a person is generous and calm then this person is lazy.", "If a person is confident then this person is trustworthy.", "If a person is loyal and nervous then this person is honest.", "If a person is beautiful then this person is generous.", "If a person is friendly then this person is beautiful.", "If a person is shy and wise then this person is friendly."], "Phenomenon": "Jessica is lazy", "PossibleCause": "Jessica is wise", "Label": "True"}
{"Premises": ["Mark is curious", "Mark is intelligent", "Mark is kind"], "Rules": ["If a person is enthusiastic then this person is trustworthy.", "If a person is humorous and mature then this person is friendly.", "If a person is creative then this person is mature.", "If a person is careless and intelligent then this person is generous.", "If a person is trustworthy then this person is careless.", "If a person is nervous then this person is wise.", "If a person is humorous and positive then this person is wise.", "If a person is curious and confident then this person is enthusiastic."], "Phenomenon": "Mark is generous", "PossibleCause": "Mark is confident", "Label": "True"}
{"Premises": ["Jack is trustworthy", "Jack is curious", "Jack is honest"], "Rules": ["If a person is angry then this person is quiet.", "If a person is happy then this person is generous.", "If a person is angry and patient then this person is quiet.", "If a person is enthusiastic and curious then this person is friendly.", "If a person is generous then this person is enthusiastic.", "If a person is patient then this person is patient.", "If a person is loyal and creative then this person is intelligent.", "If a person is trustworthy and careless then this person is happy."], "Phenomenon": "Jack is friendly", "PossibleCause": "Jack is careless", "Label": "True"}
{"Premises": ["Charles is positive", "Charles is generous", "Charles is intelligent"], "Rules": ["If a person is enthusiastic and generous then this person is friendly.", "If a person is positive and loyal then this person is excited.", "If a person is angry then this person is kind.", "If a person is angry and lazy then this person is quiet.", "If a person is excited then this person is creative.", "If a person is wise then this person is kind.", "If a person is creative then this person is enthusiastic.", "If a person is wise and kind then this person is kind."], "Phenomenon": "Charles is friendly", "PossibleCause": "Charles is loyal", "Label": "True"}
{"Premises": ["Paul is mature", "Paul is friendly", "Paul is honest"], "Rules": ["If a person is kind then this person is trustworthy.", "If a person is patient then this person is nervous.", "If a person is excited then this person is patient.", "If a person is excited and confident then this person is quiet.", "If a person is curious then this person is kind.", "If a person is outgoing and patient then this person is nervous.", "If a person is mature and loyal then this person is curious.", "If a person is trustworthy and friendly then this person is humorous."], "Phenomenon": "Paul is humorous", "PossibleCause": "Paul is loyal", "Label": "True"}
{"Premises": ["James is nervous", "James is responsible", "James is angry"], "Rules": ["If a person is brave then this person is patient.", "If a person is kind and kind then this person is careless.", "If a person is patient then this person is beautiful.", "If a person is outgoing and careless then this person is humorous.", "If a person is outgoing then this person is creative.", "If a person is shy then this person is careless.", "If a person is nervous and lazy then this person is brave.", "If a person is beautiful and responsible then this person is wise."], "Phenomenon": "James is wise", "PossibleCause": "James is lazy", "Label": "True"}
{"Premises": ["Paul is beautiful", "Paul is kind", "Paul is curious"], "Rules": ["If a person is trustworthy and intelligent then this person is generous.", "If a person is careless then this person is happy.", "If a person is happy then this person is humorous.", "If a person is beautiful and brave then this person is careless.", "If a person is trustworthy then this person is patient.", "If a person is trustworthy and intelligent then this person is generous.", "If a person is humorous and kind then this person is lazy.", "If a person is confident then this person is patient."], "Phenomenon": "Paul is lazy", "PossibleCause": "Paul is trustworthy", "Label": "False"}
{"Premises": ["Gary is shy", "Gary is enthusiastic", "Gary is wise"], "Rules": ["If a person is patient and enthusiastic then this person is mature.", "If a person is careless then this person is patient.", "If a person is lazy and angry then this person is outgoing.", "If a person is shy and humorous then this person is quiet.", "If a person is quiet then this person is careless.", "If a person is angry then this person is outgoing.", "If a person is kind then this person is outgoing.", "If a person is lazy and responsible then this person is outgoing."], "Phenomenon": "Gary is mature", "PossibleCause": "Gary is humorous", "Label": "True"}
{"Premises": ["Jessica is calm", "Jessica is angry", "Jessica is brave"], "Rules": ["If a person is beautiful then this person is beautiful.", "If a person is positive then this person is mature.", "If a person is mature then this person is generous.", "If a person is enthusiastic and trustworthy then this person is humorous.", "If a person is trustworthy and trustworthy then this person is shy.", "If a person is calm and careless then this person is positive.", "If a person is outgoing then this person is humorous.", "If a person is generous and angry then this person is nervous."], "Phenomenon": "Jessica is nervous", "PossibleCause": "Jessica is enthusiastic", "Label": "False"}
{"Premises": ["Peter is nervous", "Peter is honest", "Peter is intelligent"], "Rules": ["If a person is shy then this person is creative.", "If a person is mature then this person is happy.", "If a person is outgoing and excited then this person is happy.", "If a person is creative and honest then this person is positive.", "If a person is nervous and kind then this person is wise.", "If a person is wise then this person is shy.", "If a person is patient then this person is happy.", "If a person is mature and outgoing then this person is happy."], "Phenomenon": "Peter is positive", "PossibleCause": "Peter is kind", "Label": "True"}
{"Premises": ["Charles is angry", "Charles is calm", "Charles is careless"], "Rules": ["If a person is nervous then this person is honest.", "If a person is humorous then this person is creative.", "If a person is angry and responsible then this person is outgoing.", "If a person is enthusiastic and calm then this person is trustworthy.", "If a person is outgoing then this person is friendly.", "If a person is friendly then this person is enthusiastic.", "If a person is nervous and honest then this person is creative.", "If a person is humorous and honest then this person is curious."], "Phenomenon": "Charles is trustworthy", "PossibleCause": "Charles is responsible", "Label": "True"}
{"Premises": ["David is curious", "David is wise", "David is happy"], "Rules": ["If a person is intelligent and enthusiastic then this person is quiet.", "If a person is mature and wise then this person is generous.", "If a person is responsible then this person is trustworthy.", "If a person is shy and shy then this person is trustworthy.", "If a person is friendly then this person is mature.", "If a person is loyal then this person is friendly.", "If a person is curious and confident then this person is loyal.", "If a person is intelligent then this person is trustworthy."], "Phenomenon": "David is generous", "PossibleCause": "David is confident", "Label": "True"}
{"Premises": ["Helen is lazy", "Helen is kind", "Helen is humorous"], "Rules": ["If a person is calm and loyal then this person is friendly.", "If a person is quiet and kind then this person is generous.", "If a person is outgoing then this person is outgoing.", "If a person is curious then this person is quiet.", "If a person is lazy and happy then this person is trustworthy.", "If a person is trustworthy then this person is curious.", "If a person is careless then this person is outgoing.", "If a person is careless and friendly then this person is nervous."], "Phenomenon": "Helen is generous", "PossibleCause": "Helen is happy", "Label": "True"}
{"Premises": ["Justin is happy", "Justin is mature", "Justin is friendly"], "Rules": ["If a person is outgoing and wise then this person is excited.", "If a person is lazy then this person is intelligent.", "If a person is wise then this person is responsible.", "If a person is happy and curious then this person is trustworthy.", "If a person is outgoing and quiet then this person is positive.", "If a person is intelligent and mature then this person is confident.", "If a person is quiet then this person is quiet.", "If a person is trustworthy then this person is lazy."], "Phenomenon": "Justin is confident", "PossibleCause": "Justin is curious", "Label": "True"}
{"Premises": ["Lisa is happy", "Lisa is confident", "Lisa is loyal"], "Rules": ["If a person is friendly and mature then this person is nervous.", "If a person is beautiful and confident then this person is lazy.", "If a person is friendly then this person is angry.", "If a person is enthusiastic then this person is angry.", "If a person is enthusiastic and mature then this person is nervous.", "If a person is happy and shy then this person is excited.", "If a person is excited then this person is trustworthy.", "If a person is trustworthy then this person is beautiful."], "Phenomenon": "Lisa is lazy", "PossibleCause": "Lisa is shy", "Label": "True"}
{"Premises": ["\"Charles is calm\"", "\"Charles is honest\"", "\"Charles is angry\""], "Rules": ["If a person is excited then this person is generous.", "If a person is calm and careless then this person is creative.", "If a person is excited then this person is nervous.", "If a person is quiet then this person is patient.", "If a person is intelligent and nervous then this person is generous.", "If a person is patient and honest then this person is trustworthy.", "If a person is creative then this person is quiet.", "If a person is intelligent and intelligent then this person is generous."], "Phenomenon": "Charles is trustworthy", "PossibleCause": "Charles is careless", "Label": "True"}
{"Premises": ["Robin is wise", "Robin is positive", "Robin is nervous", "Thomas is curious", "Thomas is positive", "Thomas is quiet"], "Rules": ["If a person is calm and confident then this person is confident.", "If a person is calm and calm then this person is loyal.", "If a person is wise and outgoing then this person is creative.", "If a person is responsible then this person is excited.", "If a person is kind then this person is honest.", "If a person is calm then this person is confident.", "If a person is excited and positive then this person is curious.", "If a person is creative then this person is responsible."], "Phenomenon": "Robin is curious", "PossibleCause": "Robin is outgoing", "Label": "True"}
{"Premises": ["Grace is intelligent", "Grace is positive", "Grace is responsible"], "Rules": ["If a person is friendly then this person is nervous.", "If a person is intelligent and generous then this person is friendly.", "If a person is nervous then this person is creative.", "If a person is trustworthy and calm then this person is beautiful.", "If a person is creative and positive then this person is honest.", "If a person is loyal and calm then this person is calm.", "If a person is enthusiastic then this person is calm.", "If a person is enthusiastic then this person is angry."], "Phenomenon": "Grace is honest", "PossibleCause": "Grace is trustworthy", "Label": "False"}
{"Premises": ["Grace is generous", "Grace is trustworthy", "Grace is wise"], "Rules": ["If a person is responsible then this person is happy.", "If a person is kind then this person is nervous.", "If a person is kind then this person is confident.", "If a person is happy and trustworthy then this person is honest.", "If a person is creative and nervous then this person is confident.", "If a person is shy then this person is responsible.", "If a person is generous and curious then this person is shy.", "If a person is kind and kind then this person is confident."], "Phenomenon": "Grace is honest", "PossibleCause": "Grace is curious", "Label": "True"}
{"Premises": ["Betty is honest", "Betty is shy", "Betty is friendly"], "Rules": ["If a person is nervous then this person is brave.", "If a person is quiet and wise then this person is creative.", "If a person is positive then this person is nervous.", "If a person is brave and shy then this person is beautiful.", "If a person is happy and generous then this person is mature.", "If a person is happy then this person is wise.", "If a person is honest and careless then this person is positive.", "If a person is confident then this person is generous."], "Phenomenon": "Betty is beautiful", "PossibleCause": "Betty is careless", "Label": "True"}
{"Premises": ["\"Jane is outgoing\"", "\"Jane is wise\"", "\"Jane is friendly\""], "Rules": ["If a person is intelligent then this person is positive.", "If a person is trustworthy then this person is humorous.", "If a person is trustworthy and creative then this person is nervous.", "If a person is mature and quiet then this person is nervous.", "If a person is positive and wise then this person is responsible.", "If a person is curious then this person is intelligent.", "If a person is creative then this person is humorous.", "If a person is outgoing and angry then this person is curious."], "Phenomenon": "Jane is responsible", "PossibleCause": "Jane is angry", "Label": "True"}
{"Premises": ["Anne is shy", "Anne is excited", "Anne is brave"], "Rules": ["If a person is mature and creative then this person is intelligent.", "If a person is beautiful and excited then this person is careless.", "If a person is shy and positive then this person is loyal.", "If a person is happy then this person is curious.", "If a person is kind then this person is beautiful.", "If a person is lazy then this person is intelligent.", "If a person is mature and lazy then this person is intelligent.", "If a person is loyal then this person is kind."], "Phenomenon": "Anne is careless", "PossibleCause": "Anne is positive", "Label": "True"}
{"Premises": ["Justin is honest", "Justin is mature", "Justin is quiet"], "Rules": ["If a person is honest and curious then this person is intelligent.", "If a person is brave then this person is careless.", "If a person is beautiful and careless then this person is careless.", "If a person is lazy then this person is patient.", "If a person is calm and mature then this person is shy.", "If a person is enthusiastic then this person is calm.", "If a person is beautiful and beautiful then this person is generous.", "If a person is intelligent then this person is enthusiastic."], "Phenomenon": "Justin is shy", "PossibleCause": "Justin is lazy", "Label": "False"}
{"Premises": ["Robin is responsible", "Robin is careless", "Robin is happy"], "Rules": ["If a person is mature and confident then this person is generous.", "If a person is creative then this person is confident.", "If a person is intelligent then this person is enthusiastic.", "If a person is confident then this person is confident.", "If a person is responsible and calm then this person is intelligent.", "If a person is shy and careless then this person is outgoing.", "If a person is wise and confident then this person is humorous.", "If a person is enthusiastic then this person is shy."], "Phenomenon": "Robin is outgoing", "PossibleCause": "Robin is calm", "Label": "True"}
{"Premises": ["Paul is careless", "Paul is shy", "Paul is generous"], "Rules": ["If a person is kind then this person is responsible.", "If a person is confident and shy then this person is creative.", "If a person is curious then this person is excited.", "If a person is kind and responsible then this person is responsible.", "If a person is excited then this person is confident.", "If a person is calm then this person is humorous.", "If a person is careless and outgoing then this person is curious.", "If a person is kind and intelligent then this person is responsible."], "Phenomenon": "Paul is creative", "PossibleCause": "Paul is kind", "Label": "False"}
{"Premises": ["James is calm", "James is quiet", "James is generous"], "Rules": ["If a person is calm and loyal then this person is responsible.", "If a person is brave and intelligent then this person is beautiful.", "If a person is angry then this person is positive.", "If a person is angry and intelligent then this person is beautiful.", "If a person is nervous then this person is enthusiastic.", "If a person is responsible then this person is nervous.", "If a person is friendly then this person is intelligent.", "If a person is enthusiastic and quiet then this person is creative."], "Phenomenon": "James is creative", "PossibleCause": "James is loyal", "Label": "True"}
{"Premises": ["Lucy is creative", "Lucy is patient", "Lucy is wise"], "Rules": ["If a person is brave and patient then this person is careless.", "If a person is excited and beautiful then this person is enthusiastic.", "If a person is intelligent then this person is curious.", "If a person is excited and beautiful then this person is curious.", "If a person is creative and confident then this person is nervous.", "If a person is intelligent then this person is enthusiastic.", "If a person is quiet then this person is brave.", "If a person is nervous then this person is quiet."], "Phenomenon": "Lucy is careless", "PossibleCause": "Lucy is confident", "Label": "True"}
{"Premises": ["Peter is patient", "Peter is humorous", "Peter is generous"], "Rules": ["If a person is confident and calm then this person is loyal.", "If a person is confident and calm then this person is loyal.", "If a person is intelligent then this person is trustworthy.", "If a person is excited then this person is shy.", "If a person is trustworthy then this person is careless.", "If a person is confident then this person is calm.", "If a person is patient and kind then this person is intelligent.", "If a person is careless and humorous then this person is creative."], "Phenomenon": "Peter is creative", "PossibleCause": "Peter is kind", "Label": "True"}
{"Premises": ["Robin is lazy", "Robin is brave", "Robin is responsible"], "Rules": ["If a person is intelligent then this person is happy.", "If a person is confident then this person is mature.", "If a person is intelligent and generous then this person is careless.", "If a person is friendly and brave then this person is angry.", "If a person is lazy and nervous then this person is confident.", "If a person is mature then this person is friendly.", "If a person is calm and calm then this person is happy.", "If a person is generous then this person is humorous."], "Phenomenon": "Robin is angry", "PossibleCause": "Robin is nervous", "Label": "True"}
{"Premises": ["Sandy is excited", "Sandy is curious", "Sandy is mature"], "Rules": ["If a person is patient and patient then this person is honest.", "If a person is patient and patient then this person is outgoing.", "If a person is patient then this person is honest.", "If a person is brave and curious then this person is friendly.", "If a person is happy then this person is brave.", "If a person is responsible then this person is responsible.", "If a person is excited and confident then this person is nervous.", "If a person is nervous then this person is happy."], "Phenomenon": "Sandy is friendly", "PossibleCause": "Sandy is confident", "Label": "True"}
{"Premises": ["Betty is mature", "Betty is kind", "Betty is honest"], "Rules": ["If a person is mature and calm then this person is patient.", "If a person is creative and kind then this person is responsible.", "If a person is patient then this person is loyal.", "If a person is generous then this person is curious.", "If a person is nervous and brave then this person is curious.", "If a person is generous and brave then this person is curious.", "If a person is brave then this person is curious.", "If a person is loyal then this person is creative."], "Phenomenon": "Betty is responsible", "PossibleCause": "Betty is calm", "Label": "True"}
{"Premises": ["Helen is confident", "Helen is intelligent", "Helen is enthusiastic"], "Rules": ["If a person is brave then this person is beautiful.", "If a person is excited and curious then this person is wise.", "If a person is loyal then this person is angry.", "If a person is confident and quiet then this person is loyal.", "If a person is kind and patient then this person is beautiful.", "If a person is lazy and intelligent then this person is shy.", "If a person is angry then this person is lazy.", "If a person is patient then this person is patient."], "Phenomenon": "Helen is shy", "PossibleCause": "Helen is kind", "Label": "False"}
{"Premises": ["Betty is brave", "Betty is mature", "Betty is positive"], "Rules": ["If a person is excited then this person is calm.", "If a person is humorous and loyal then this person is loyal.", "If a person is curious then this person is loyal.", "If a person is curious and curious then this person is creative.", "If a person is humorous then this person is creative.", "If a person is calm then this person is beautiful.", "If a person is brave and angry then this person is excited.", "If a person is beautiful and mature then this person is generous."], "Phenomenon": "Betty is generous", "PossibleCause": "Betty is angry", "Label": "True"}
{"Premises": ["Betty is confident", "Betty is brave", "Betty is humorous"], "Rules": ["If a person is confident and kind then this person is shy.", "If a person is generous and brave then this person is beautiful.", "If a person is intelligent and friendly then this person is responsible.", "If a person is nervous then this person is generous.", "If a person is intelligent and responsible then this person is responsible.", "If a person is loyal then this person is friendly.", "If a person is shy then this person is nervous.", "If a person is friendly then this person is responsible."], "Phenomenon": "Betty is beautiful", "PossibleCause": "Betty is kind", "Label": "True"}
{"Premises": ["Jessica is careless", "Jessica is confident", "Jessica is loyal"], "Rules": ["If a person is nervous and confident then this person is honest.", "If a person is brave then this person is nervous.", "If a person is friendly and creative then this person is excited.", "If a person is beautiful then this person is brave.", "If a person is positive and creative then this person is patient.", "If a person is careless and angry then this person is beautiful.", "If a person is enthusiastic then this person is excited.", "If a person is friendly then this person is shy."], "Phenomenon": "Jessica is honest", "PossibleCause": "Jessica is angry", "Label": "True"}
{"Premises": ["Gary is careless", "Gary is angry", "Gary is enthusiastic"], "Rules": ["If a person is wise and beautiful then this person is mature.", "If a person is excited then this person is brave.", "If a person is careless and positive then this person is patient.", "If a person is wise then this person is beautiful.", "If a person is patient then this person is excited.", "If a person is trustworthy then this person is beautiful.", "If a person is trustworthy and beautiful then this person is beautiful.", "If a person is brave and angry then this person is kind."], "Phenomenon": "Gary is kind", "PossibleCause": "Gary is positive", "Label": "True"}
{"Premises": ["Helen is curious", "Helen is quiet", "Helen is responsible"], "Rules": ["If a person is lazy then this person is kind.", "If a person is shy and quiet then this person is patient.", "If a person is excited then this person is happy.", "If a person is brave and brave then this person is friendly.", "If a person is curious and creative then this person is lazy.", "If a person is positive then this person is friendly.", "If a person is excited and positive then this person is nervous.", "If a person is kind then this person is shy."], "Phenomenon": "Helen is patient", "PossibleCause": "Helen is creative", "Label": "True"}
{"Premises": ["Thomas is generous", "Thomas is curious", "Thomas is nervous"], "Rules": ["If a person is beautiful then this person is positive.", "If a person is generous and mature then this person is lazy.", "If a person is shy then this person is calm.", "If a person is brave and excited then this person is wise.", "If a person is beautiful then this person is patient.", "If a person is beautiful and creative then this person is excited.", "If a person is calm and curious then this person is trustworthy.", "If a person is lazy then this person is shy."], "Phenomenon": "Thomas is trustworthy", "PossibleCause": "Thomas is mature", "Label": "True"}
{"Premises": ["Peter is shy", "Peter is trustworthy", "Peter is enthusiastic"], "Rules": ["If a person is responsible then this person is positive.", "If a person is positive and trustworthy then this person is loyal.", "If a person is confident then this person is responsible.", "If a person is honest then this person is patient.", "If a person is shy and brave then this person is confident.", "If a person is honest then this person is wise.", "If a person is mature and wise then this person is curious.", "If a person is honest and beautiful then this person is wise."], "Phenomenon": "Peter is loyal", "PossibleCause": "Peter is brave", "Label": "True"}
{"Premises": ["Ted is friendly", "Ted is creative", "Ted is responsible", "Lisa is positive", "Lisa is creative"], "Rules": ["If a person is lazy then this person is loyal.", "If a person is shy and loyal then this person is careless.", "If a person is happy and loyal then this person is loyal.", "If a person is patient then this person is enthusiastic.", "If a person is friendly and wise then this person is patient.", "If a person is shy then this person is loyal.", "If a person is brave and creative then this person is positive.", "If a person is enthusiastic then this person is brave."], "Phenomenon": "Ted is positive", "PossibleCause": "Ted is wise", "Label": "True"}
{"Premises": ["Denis is intelligent", "Denis is beautiful", "Denis is excited"], "Rules": ["If a person is humorous then this person is positive.", "If a person is brave then this person is humorous.", "If a person is outgoing then this person is quiet.", "If a person is intelligent and shy then this person is brave.", "If a person is creative and responsible then this person is quiet.", "If a person is generous and trustworthy then this person is confident.", "If a person is positive and beautiful then this person is angry.", "If a person is creative then this person is quiet."], "Phenomenon": "Denis is angry", "PossibleCause": "Denis is shy", "Label": "True"}
{"Premises": ["Lucy is confident", "Lucy is trustworthy", "Lucy is positive"], "Rules": ["If a person is creative then this person is brave.", "If a person is enthusiastic then this person is mature.", "If a person is mature then this person is kind.", "If a person is angry then this person is curious.", "If a person is kind and trustworthy then this person is calm.", "If a person is confident and generous then this person is enthusiastic.", "If a person is excited and excited then this person is friendly.", "If a person is loyal and brave then this person is curious."], "Phenomenon": "Lucy is calm", "PossibleCause": "Lucy is generous", "Label": "True"}
{"Premises": ["Peter is curious", "Peter is humorous", "Peter is generous"], "Rules": ["If a person is curious and friendly then this person is honest.", "If a person is trustworthy then this person is creative.", "If a person is honest then this person is trustworthy.", "If a person is lazy then this person is positive.", "If a person is creative and humorous then this person is nervous.", "If a person is quiet then this person is positive.", "If a person is outgoing and lazy then this person is positive.", "If a person is happy and confident then this person is excited."], "Phenomenon": "Peter is nervous", "PossibleCause": "Peter is outgoing", "Label": "False"}
{"Premises": ["Charles is quiet", "Charles is wise", "Charles is kind"], "Rules": ["If a person is brave and brave then this person is enthusiastic.", "If a person is careless then this person is curious.", "If a person is curious and wise then this person is shy.", "If a person is friendly then this person is angry.", "If a person is friendly and enthusiastic then this person is enthusiastic.", "If a person is brave then this person is angry.", "If a person is quiet and confident then this person is trustworthy.", "If a person is trustworthy then this person is careless."], "Phenomenon": "Charles is shy", "PossibleCause": "Charles is confident", "Label": "True"}
{"Premises": ["Peter is trustworthy", "Peter is happy", "Peter is wise", "Bob is wise"], "Rules": ["If a person is lazy and happy then this person is excited.", "If a person is honest then this person is loyal.", "If a person is quiet then this person is humorous.", "If a person is patient and friendly then this person is mature.", "If a person is humorous then this person is lazy.", "If a person is patient and brave then this person is friendly.", "If a person is creative then this person is brave.", "If a person is trustworthy and outgoing then this person is quiet."], "Phenomenon": "Peter is excited", "PossibleCause": "Peter is patient", "Label": "False"}
{"Premises": ["Lisa is happy", "Lisa is creative", "Lisa is friendly"], "Rules": ["If a person is lazy and creative then this person is humorous.", "If a person is intelligent and nervous then this person is brave.", "If a person is intelligent then this person is brave.", "If a person is happy and outgoing then this person is honest.", "If a person is honest then this person is curious.", "If a person is beautiful and nervous then this person is careless.", "If a person is intelligent then this person is nervous.", "If a person is curious then this person is lazy."], "Phenomenon": "Lisa is humorous", "PossibleCause": "Lisa is outgoing", "Label": "True"}
{"Premises": ["James is friendly", "James is humorous", "James is quiet"], "Rules": ["If a person is wise and humorous then this person is trustworthy.", "If a person is confident then this person is wise.", "If a person is lazy and beautiful then this person is creative.", "If a person is mature then this person is mature.", "If a person is angry and outgoing then this person is shy.", "If a person is honest then this person is confident.", "If a person is friendly and enthusiastic then this person is honest.", "If a person is lazy then this person is mature."], "Phenomenon": "James is trustworthy", "PossibleCause": "James is enthusiastic", "Label": "True"}
{"Premises": ["Justin is friendly", "Justin is intelligent", "Justin is kind"], "Rules": ["If a person is angry then this person is outgoing.", "If a person is mature then this person is quiet.", "If a person is mature then this person is calm.", "If a person is friendly and responsible then this person is angry.", "If a person is mature and positive then this person is calm.", "If a person is mature and positive then this person is calm.", "If a person is creative and intelligent then this person is humorous.", "If a person is outgoing then this person is creative."], "Phenomenon": "Justin is humorous", "PossibleCause": "Justin is responsible", "Label": "True"}
{"Premises": ["Jessica is careless", "Jessica is confident", "Jessica is loyal"], "Rules": ["If a person is careless and honest then this person is generous.", "If a person is quiet and confident then this person is calm.", "If a person is mature then this person is brave.", "If a person is enthusiastic then this person is patient.", "If a person is outgoing and intelligent then this person is shy.", "If a person is outgoing and enthusiastic then this person is brave.", "If a person is generous then this person is friendly.", "If a person is friendly then this person is quiet."], "Phenomenon": "Jessica is calm", "PossibleCause": "Jessica is honest", "Label": "True"}
{"Premises": ["Eric is nervous", "Eric is intelligent", "Eric is responsible"], "Rules": ["If a person is kind then this person is creative.", "If a person is confident and intelligent then this person is curious.", "If a person is trustworthy and calm then this person is outgoing.", "If a person is trustworthy then this person is happy.", "If a person is trustworthy and happy then this person is excited.", "If a person is creative then this person is confident.", "If a person is nervous and generous then this person is kind.", "If a person is loyal then this person is happy."], "Phenomenon": "Eric is curious", "PossibleCause": "Eric is generous", "Label": "True"}
{"Premises": ["Lucy is intelligent", "Lucy is patient", "Lucy is brave"], "Rules": ["If a person is wise then this person is nervous.", "If a person is responsible then this person is positive.", "If a person is lazy and curious then this person is curious.", "If a person is intelligent and mature then this person is beautiful.", "If a person is beautiful then this person is responsible.", "If a person is positive and patient then this person is kind.", "If a person is lazy and wise then this person is nervous.", "If a person is lazy then this person is curious."], "Phenomenon": "Lucy is kind", "PossibleCause": "Lucy is honest", "Label": "False"}
{"Premises": ["Paul is mature", "Paul is loyal", "Paul is creative"], "Rules": ["If a person is wise then this person is angry.", "If a person is trustworthy and loyal then this person is nervous.", "If a person is mature and shy then this person is wise.", "If a person is honest and confident then this person is careless.", "If a person is confident and confident then this person is careless.", "If a person is generous then this person is beautiful.", "If a person is confident then this person is beautiful.", "If a person is angry then this person is trustworthy."], "Phenomenon": "Paul is nervous", "PossibleCause": "Paul is generous", "Label": "False"}
{"Premises": ["Peter is quiet", "Peter is loyal", "Peter is lazy"], "Rules": ["If a person is outgoing then this person is positive.", "If a person is patient then this person is outgoing.", "If a person is wise and excited then this person is intelligent.", "If a person is quiet and calm then this person is patient.", "If a person is honest and wise then this person is excited.", "If a person is wise then this person is intelligent.", "If a person is positive and loyal then this person is humorous.", "If a person is wise then this person is beautiful."], "Phenomenon": "Peter is humorous", "PossibleCause": "Peter is calm", "Label": "True"}
{"Premises": ["Anne is curious", "Anne is loyal", "Anne is shy"], "Rules": ["If a person is calm then this person is creative.", "If a person is quiet and loyal then this person is careless.", "If a person is trustworthy and humorous then this person is creative.", "If a person is confident and calm then this person is creative.", "If a person is curious and lazy then this person is happy.", "If a person is patient then this person is creative.", "If a person is happy then this person is friendly.", "If a person is friendly then this person is quiet."], "Phenomenon": "Anne is careless", "PossibleCause": "Anne is trustworthy", "Label": "False"}
{"Premises": ["Gary is lazy", "Gary is friendly", "Gary is beautiful", "Lucy is mature", "Lucy is friendly"], "Rules": ["If a person is brave and friendly then this person is mature.", "If a person is lazy and outgoing then this person is trustworthy.", "If a person is wise then this person is brave.", "If a person is generous then this person is careless.", "If a person is kind then this person is quiet.", "If a person is responsible and honest then this person is careless.", "If a person is kind and honest then this person is humorous.", "If a person is trustworthy then this person is wise."], "Phenomenon": "Gary is mature", "PossibleCause": "Gary is outgoing", "Label": "True"}
{"Premises": ["Ted is trustworthy", "Ted is confident", "Ted is honest"], "Rules": ["If a person is humorous then this person is creative.", "If a person is lazy and mature then this person is kind.", "If a person is positive and kind then this person is kind.", "If a person is creative and confident then this person is wise.", "If a person is friendly then this person is humorous.", "If a person is trustworthy and generous then this person is friendly.", "If a person is brave then this person is nervous.", "If a person is positive then this person is nervous."], "Phenomenon": "Ted is wise", "PossibleCause": "Ted is generous", "Label": "True"}
{"Premises": ["Peter is curious", "Peter is patient", "Peter is loyal"], "Rules": ["If a person is honest then this person is brave.", "If a person is happy then this person is careless.", "If a person is kind and wise then this person is mature.", "If a person is positive then this person is wise.", "If a person is enthusiastic and patient then this person is creative.", "If a person is careless then this person is enthusiastic.", "If a person is curious and trustworthy then this person is happy.", "If a person is kind and wise then this person is wise."], "Phenomenon": "Peter is creative", "PossibleCause": "Peter is trustworthy", "Label": "True"}
{"Premises": ["Helen is positive", "Helen is outgoing", "Helen is nervous"], "Rules": ["If a person is patient and lazy then this person is trustworthy.", "If a person is wise then this person is generous.", "If a person is patient then this person is happy.", "If a person is generous and outgoing then this person is kind.", "If a person is humorous then this person is wise.", "If a person is positive and quiet then this person is humorous.", "If a person is beautiful then this person is friendly.", "If a person is beautiful and lazy then this person is trustworthy."], "Phenomenon": "Helen is kind", "PossibleCause": "Helen is quiet", "Label": "True"}
{"Premises": ["James is generous", "James is trustworthy", "James is positive"], "Rules": ["If a person is excited and trustworthy then this person is lazy.", "If a person is honest then this person is nervous.", "If a person is generous and mature then this person is honest.", "If a person is angry then this person is loyal.", "If a person is angry then this person is loyal.", "If a person is nervous then this person is excited.", "If a person is angry and calm then this person is curious.", "If a person is careless and beautiful then this person is loyal."], "Phenomenon": "James is lazy", "PossibleCause": "James is mature", "Label": "True"}
{"Premises": ["Helen is loyal", "Helen is lazy", "Helen is calm"], "Rules": ["If a person is kind and lazy then this person is friendly.", "If a person is positive then this person is creative.", "If a person is wise then this person is quiet.", "If a person is loyal and honest then this person is positive.", "If a person is creative then this person is kind.", "If a person is responsible and generous then this person is intelligent.", "If a person is responsible then this person is enthusiastic.", "If a person is wise and wise then this person is quiet."], "Phenomenon": "Helen is friendly", "PossibleCause": "Helen is brave", "Label": "False"}
{"Premises": ["Jane is enthusiastic", "Jane is nervous", "Jane is positive"], "Rules": ["If a person is enthusiastic and curious then this person is happy.", "If a person is beautiful then this person is trustworthy.", "If a person is intelligent then this person is patient.", "If a person is beautiful and trustworthy then this person is humorous.", "If a person is happy then this person is intelligent.", "If a person is creative then this person is lazy.", "If a person is confident and trustworthy then this person is trustworthy.", "If a person is patient and nervous then this person is friendly."], "Phenomenon": "Jane is friendly", "PossibleCause": "Jane is curious", "Label": "True"}
{"Premises": ["Denis is mature", "Denis is honest", "Denis is wise"], "Rules": ["If a person is humorous and enthusiastic then this person is nervous.", "If a person is brave then this person is curious.", "If a person is curious and honest then this person is excited.", "If a person is mature and angry then this person is patient.", "If a person is trustworthy and enthusiastic then this person is enthusiastic.", "If a person is patient then this person is brave.", "If a person is kind then this person is enthusiastic.", "If a person is kind then this person is enthusiastic."], "Phenomenon": "Denis is excited", "PossibleCause": "Denis is angry", "Label": "True"}
{"Premises": ["Jessica is beautiful", "Jessica is quiet", "Jessica is honest"], "Rules": ["If a person is calm and quiet then this person is excited.", "If a person is confident then this person is intelligent.", "If a person is loyal then this person is intelligent.", "If a person is beautiful and humorous then this person is curious.", "If a person is careless and intelligent then this person is mature.", "If a person is careless and enthusiastic then this person is intelligent.", "If a person is friendly then this person is calm.", "If a person is curious then this person is friendly."], "Phenomenon": "Jessica is excited", "PossibleCause": "Jessica is humorous", "Label": "True"}
{"Premises": ["Charles is loyal", "Charles is careless", "Charles is enthusiastic"], "Rules": ["If a person is intelligent and careless then this person is lazy.", "If a person is happy then this person is intelligent.", "If a person is quiet and mature then this person is humorous.", "If a person is quiet then this person is outgoing.", "If a person is shy then this person is outgoing.", "If a person is shy and mature then this person is excited.", "If a person is confident then this person is happy.", "If a person is loyal and honest then this person is confident."], "Phenomenon": "Charles is lazy", "PossibleCause": "Charles is honest", "Label": "True"}
{"Premises": ["Anne is responsible", "Anne is wise", "Anne is positive"], "Rules": ["If a person is nervous and calm then this person is honest.", "If a person is nervous and honest then this person is honest.", "If a person is curious then this person is intelligent.", "If a person is beautiful then this person is humorous.", "If a person is humorous then this person is creative.", "If a person is calm then this person is honest.", "If a person is creative and wise then this person is friendly.", "If a person is responsible and brave then this person is beautiful."], "Phenomenon": "Anne is friendly", "PossibleCause": "Anne is brave", "Label": "True"}
{"Premises": ["Peter is shy", "Peter is loyal", "Peter is angry"], "Rules": ["If a person is careless then this person is curious.", "If a person is kind and kind then this person is intelligent.", "If a person is shy and nervous then this person is happy.", "If a person is careless and kind then this person is curious.", "If a person is happy then this person is generous.", "If a person is outgoing and loyal then this person is creative.", "If a person is careless then this person is curious.", "If a person is generous then this person is outgoing."], "Phenomenon": "Peter is creative", "PossibleCause": "Peter is nervous", "Label": "True"}
{"Premises": ["Mark is shy", "Mark is intelligent", "Mark is beautiful"], "Rules": ["If a person is wise then this person is responsible.", "If a person is honest then this person is wise.", "If a person is enthusiastic and trustworthy then this person is happy.", "If a person is creative then this person is trustworthy.", "If a person is responsible and intelligent then this person is mature.", "If a person is shy and excited then this person is honest.", "If a person is kind then this person is loyal.", "If a person is kind and kind then this person is loyal."], "Phenomenon": "Mark is mature", "PossibleCause": "Mark is excited", "Label": "True"}
{"Premises": ["Jane is honest", "Jane is wise", "Jane is quiet"], "Rules": ["If a person is brave then this person is curious.", "If a person is confident then this person is friendly.", "If a person is nervous then this person is humorous.", "If a person is careless and wise then this person is shy.", "If a person is humorous then this person is careless.", "If a person is kind and curious then this person is friendly.", "If a person is kind and curious then this person is trustworthy.", "If a person is honest and happy then this person is nervous."], "Phenomenon": "Jane is shy", "PossibleCause": "Jane is kind", "Label": "False"}
{"Premises": ["Ted is trustworthy", "Ted is loyal", "Ted is intelligent"], "Rules": ["If a person is responsible then this person is calm.", "If a person is nervous then this person is calm.", "If a person is nervous and nervous then this person is creative.", "If a person is careless and loyal then this person is patient.", "If a person is enthusiastic then this person is careless.", "If a person is friendly then this person is enthusiastic.", "If a person is nervous and nervous then this person is mature.", "If a person is trustworthy and lazy then this person is friendly."], "Phenomenon": "Ted is patient", "PossibleCause": "Ted is kind", "Label": "False"}
{"Premises": ["Frank is responsible", "Frank is intelligent", "Frank is excited"], "Rules": ["If a person is enthusiastic and shy then this person is positive.", "If a person is quiet then this person is careless.", "If a person is responsible and calm then this person is patient.", "If a person is careless and intelligent then this person is confident.", "If a person is enthusiastic then this person is creative.", "If a person is enthusiastic and shy then this person is shy.", "If a person is patient then this person is quiet.", "If a person is trustworthy then this person is positive."], "Phenomenon": "Frank is confident", "PossibleCause": "Frank is calm", "Label": "True"}
{"Premises": ["Thomas is intelligent", "Thomas is confident", "Thomas is shy"], "Rules": ["If a person is excited then this person is enthusiastic.", "If a person is quiet then this person is beautiful.", "If a person is excited then this person is trustworthy.", "If a person is beautiful then this person is lazy.", "If a person is kind and outgoing then this person is enthusiastic.", "If a person is lazy and confident then this person is mature.", "If a person is intelligent and calm then this person is quiet.", "If a person is excited and nervous then this person is trustworthy."], "Phenomenon": "Thomas is mature", "PossibleCause": "Thomas is calm", "Label": "True"}
{"Premises": ["Denis is generous", "Denis is calm", "Denis is intelligent"], "Rules": ["If a person is honest and beautiful then this person is humorous.", "If a person is excited then this person is kind.", "If a person is honest then this person is beautiful.", "If a person is curious and careless then this person is shy.", "If a person is beautiful then this person is beautiful.", "If a person is kind then this person is positive.", "If a person is generous and responsible then this person is excited.", "If a person is positive and calm then this person is enthusiastic."], "Phenomenon": "Denis is enthusiastic", "PossibleCause": "Denis is responsible", "Label": "True"}
{"Premises": ["Helen is kind", "Helen is creative", "Helen is confident"], "Rules": ["If a person is generous and patient then this person is patient.", "If a person is honest and generous then this person is loyal.", "If a person is enthusiastic and creative then this person is excited.", "If a person is friendly then this person is quiet.", "If a person is generous then this person is humorous.", "If a person is kind and intelligent then this person is friendly.", "If a person is generous then this person is patient.", "If a person is quiet then this person is enthusiastic."], "Phenomenon": "Helen is excited", "PossibleCause": "Helen is intelligent", "Label": "True"}
{"Premises": ["Jane is honest", "Jane is excited", "Jane is friendly"], "Rules": ["If a person is angry then this person is humorous.", "If a person is intelligent and creative then this person is trustworthy.", "If a person is humorous then this person is outgoing.", "If a person is intelligent then this person is trustworthy.", "If a person is honest and brave then this person is angry.", "If a person is happy then this person is creative.", "If a person is happy and happy then this person is responsible.", "If a person is outgoing and excited then this person is careless."], "Phenomenon": "Jane is careless", "PossibleCause": "Jane is brave", "Label": "True"}
{"Premises": ["Paul is happy", "Paul is shy", "Paul is humorous"], "Rules": ["If a person is kind then this person is curious.", "If a person is wise then this person is angry.", "If a person is positive then this person is kind.", "If a person is curious and shy then this person is intelligent.", "If a person is responsible and generous then this person is generous.", "If a person is confident and confident then this person is generous.", "If a person is happy and loyal then this person is positive.", "If a person is creative then this person is generous."], "Phenomenon": "Paul is intelligent", "PossibleCause": "Paul is loyal", "Label": "True"}
{"Premises": ["David is quiet", "David is humorous", "David is friendly"], "Rules": ["If a person is quiet and loyal then this person is honest.", "If a person is patient and humorous then this person is wise.", "If a person is enthusiastic then this person is patient.", "If a person is honest then this person is enthusiastic.", "If a person is careless then this person is careless.", "If a person is excited and curious then this person is beautiful.", "If a person is happy then this person is curious.", "If a person is outgoing and curious then this person is shy."], "Phenomenon": "David is wise", "PossibleCause": "David is loyal", "Label": "True"}
{"Premises": ["James is trustworthy", "James is confident", "James is excited"], "Rules": ["If a person is friendly then this person is mature.", "If a person is angry and calm then this person is careless.", "If a person is kind then this person is careless.", "If a person is responsible and confident then this person is generous.", "If a person is kind and calm then this person is careless.", "If a person is trustworthy and nervous then this person is friendly.", "If a person is mature then this person is responsible.", "If a person is angry then this person is calm."], "Phenomenon": "James is generous", "PossibleCause": "James is angry", "Label": "False"}
{"Premises": ["Thomas is honest", "Thomas is generous", "Thomas is trustworthy"], "Rules": ["If a person is intelligent and patient then this person is beautiful.", "If a person is intelligent then this person is beautiful.", "If a person is kind then this person is responsible.", "If a person is shy then this person is kind.", "If a person is confident and patient then this person is positive.", "If a person is honest and humorous then this person is shy.", "If a person is responsible and generous then this person is careless.", "If a person is patient then this person is patient."], "Phenomenon": "Thomas is careless", "PossibleCause": "Thomas is humorous", "Label": "True"}
{"Premises": ["Thomas is mature", "Thomas is lazy", "Thomas is loyal"], "Rules": ["If a person is happy and intelligent then this person is creative.", "If a person is happy then this person is positive.", "If a person is shy and lazy then this person is beautiful.", "If a person is mature and angry then this person is excited.", "If a person is calm then this person is creative.", "If a person is intelligent and positive then this person is quiet.", "If a person is excited then this person is brave.", "If a person is brave then this person is shy."], "Phenomenon": "Thomas is beautiful", "PossibleCause": "Thomas is angry", "Label": "True"}
{"Premises": ["Thomas is beautiful", "Thomas is confident", "Thomas is lazy"], "Rules": ["If a person is enthusiastic then this person is positive.", "If a person is curious then this person is positive.", "If a person is honest then this person is friendly.", "If a person is enthusiastic and positive then this person is quiet.", "If a person is friendly and confident then this person is happy.", "If a person is wise then this person is honest.", "If a person is enthusiastic and positive then this person is angry.", "If a person is beautiful and patient then this person is wise."], "Phenomenon": "Thomas is happy", "PossibleCause": "Thomas is patient", "Label": "True"}
{"Premises": ["Lucy is excited", "Lucy is brave", "Lucy is wise"], "Rules": ["If a person is creative then this person is careless.", "If a person is careless then this person is responsible.", "If a person is patient then this person is generous.", "If a person is quiet and careless then this person is responsible.", "If a person is creative and humorous then this person is angry.", "If a person is enthusiastic and brave then this person is confident.", "If a person is generous then this person is enthusiastic.", "If a person is excited and positive then this person is patient."], "Phenomenon": "Lucy is confident", "PossibleCause": "Lucy is positive", "Label": "True"}
{"Premises": ["Gary is outgoing", "Gary is enthusiastic", "Gary is kind"], "Rules": ["If a person is confident and humorous then this person is beautiful.", "If a person is curious and enthusiastic then this person is trustworthy.", "If a person is humorous then this person is humorous.", "If a person is outgoing and mature then this person is shy.", "If a person is lazy then this person is curious.", "If a person is honest and confident then this person is loyal.", "If a person is honest then this person is beautiful.", "If a person is shy then this person is lazy."], "Phenomenon": "Gary is trustworthy", "PossibleCause": "Gary is mature", "Label": "True"}
{"Premises": ["Adam is wise", "Adam is generous", "Adam is trustworthy"], "Rules": ["If a person is outgoing then this person is quiet.", "If a person is honest then this person is outgoing.", "If a person is quiet and generous then this person is beautiful.", "If a person is shy then this person is confident.", "If a person is shy and angry then this person is confident.", "If a person is loyal then this person is loyal.", "If a person is wise and intelligent then this person is honest.", "If a person is shy and angry then this person is brave."], "Phenomenon": "Adam is beautiful", "PossibleCause": "Adam is intelligent", "Label": "True"}
{"Premises": ["Charles is confident", "Charles is friendly", "Charles is brave"], "Rules": ["If a person is outgoing then this person is honest.", "If a person is creative then this person is angry.", "If a person is careless and careless then this person is honest.", "If a person is angry and friendly then this person is intelligent.", "If a person is confident and lazy then this person is enthusiastic.", "If a person is outgoing then this person is shy.", "If a person is wise and honest then this person is honest.", "If a person is enthusiastic then this person is creative."], "Phenomenon": "Charles is intelligent", "PossibleCause": "Charles is lazy", "Label": "True"}
{"Premises": ["Jack is patient", "Jack is responsible", "Jack is wise"], "Rules": ["If a person is kind then this person is lazy.", "If a person is trustworthy then this person is angry.", "If a person is quiet and curious then this person is curious.", "If a person is angry and responsible then this person is enthusiastic.", "If a person is calm then this person is lazy.", "If a person is quiet and kind then this person is lazy.", "If a person is patient and mature then this person is careless.", "If a person is careless then this person is trustworthy."], "Phenomenon": "Jack is enthusiastic", "PossibleCause": "Jack is mature", "Label": "True"}
{"Premises": ["Charles is brave", "Charles is enthusiastic", "Charles is trustworthy"], "Rules": ["If a person is patient then this person is confident.", "If a person is humorous and beautiful then this person is wise.", "If a person is intelligent then this person is beautiful.", "If a person is humorous and mature then this person is beautiful.", "If a person is intelligent then this person is mature.", "If a person is calm and enthusiastic then this person is creative.", "If a person is brave and responsible then this person is patient.", "If a person is confident then this person is calm."], "Phenomenon": "Charles is creative", "PossibleCause": "Charles is responsible", "Label": "True"}
{"Premises": ["Betty is shy", "Betty is lazy", "Betty is quiet"], "Rules": ["If a person is confident then this person is angry.", "If a person is shy and enthusiastic then this person is confident.", "If a person is excited and humorous then this person is friendly.", "If a person is careless and lazy then this person is honest.", "If a person is curious and friendly then this person is nervous.", "If a person is angry then this person is careless.", "If a person is excited then this person is friendly.", "If a person is humorous then this person is friendly."], "Phenomenon": "Betty is honest", "PossibleCause": "Betty is enthusiastic", "Label": "True"}
{"Premises": ["Paul is outgoing", "Paul is happy", "Paul is confident"], "Rules": ["If a person is outgoing and trustworthy then this person is loyal.", "If a person is intelligent then this person is shy.", "If a person is creative and mature then this person is honest.", "If a person is brave then this person is beautiful.", "If a person is intelligent then this person is honest.", "If a person is beautiful and happy then this person is nervous.", "If a person is loyal then this person is brave.", "If a person is mature and mature then this person is honest."], "Phenomenon": "Paul is nervous", "PossibleCause": "Paul is trustworthy", "Label": "True"}
{"Premises": ["Robert is careless", "Robert is outgoing", "Robert is excited"], "Rules": ["If a person is beautiful then this person is creative.", "If a person is careless and responsible then this person is beautiful.", "If a person is generous and brave then this person is angry.", "If a person is creative then this person is patient.", "If a person is patient and outgoing then this person is wise.", "If a person is friendly then this person is intelligent.", "If a person is generous and intelligent then this person is brave.", "If a person is friendly then this person is angry."], "Phenomenon": "Robert is wise", "PossibleCause": "Robert is responsible", "Label": "True"}
{"Premises": ["Grace is calm", "Grace is shy", "Grace is outgoing"], "Rules": ["If a person is confident then this person is careless.", "If a person is calm and mature then this person is excited.", "If a person is excited then this person is happy.", "If a person is brave and shy then this person is creative.", "If a person is curious and confident then this person is lazy.", "If a person is intelligent and curious then this person is careless.", "If a person is curious then this person is confident.", "If a person is happy then this person is brave."], "Phenomenon": "Grace is creative", "PossibleCause": "Grace is mature", "Label": "True"}
{"Premises": ["Robin is wise", "Robin is positive", "Robin is angry"], "Rules": ["If a person is shy and beautiful then this person is enthusiastic.", "If a person is excited and positive then this person is nervous.", "If a person is curious then this person is excited.", "If a person is wise and patient then this person is creative.", "If a person is brave and humorous then this person is beautiful.", "If a person is creative then this person is curious.", "If a person is brave then this person is careless.", "If a person is humorous then this person is careless."], "Phenomenon": "Robin is nervous", "PossibleCause": "Robin is patient", "Label": "True"}
{"Premises": ["Sandy is trustworthy", "Sandy is creative", "Sandy is honest"], "Rules": ["If a person is careless then this person is kind.", "If a person is happy then this person is curious.", "If a person is quiet and careless then this person is loyal.", "If a person is quiet and generous then this person is loyal.", "If a person is intelligent and creative then this person is responsible.", "If a person is outgoing then this person is generous.", "If a person is curious then this person is intelligent.", "If a person is trustworthy and friendly then this person is happy."], "Phenomenon": "Sandy is responsible", "PossibleCause": "Sandy is friendly", "Label": "True"}
{"Premises": ["Tom is beautiful", "Tom is happy", "Tom is intelligent"], "Rules": ["If a person is curious then this person is wise.", "If a person is quiet and lazy then this person is trustworthy.", "If a person is positive then this person is positive.", "If a person is angry and careless then this person is trustworthy.", "If a person is honest and happy then this person is enthusiastic.", "If a person is wise then this person is honest.", "If a person is quiet then this person is careless.", "If a person is beautiful and brave then this person is curious."], "Phenomenon": "Tom is enthusiastic", "PossibleCause": "Tom is angry", "Label": "False"}
{"Premises": ["Robert is curious", "Robert is responsible", "Robert is trustworthy"], "Rules": ["If a person is lazy then this person is outgoing.", "If a person is curious and positive then this person is lazy.", "If a person is outgoing then this person is kind.", "If a person is honest and friendly then this person is intelligent.", "If a person is honest and friendly then this person is intelligent.", "If a person is honest then this person is happy.", "If a person is kind and responsible then this person is generous.", "If a person is honest then this person is friendly."], "Phenomenon": "Robert is generous", "PossibleCause": "Robert is positive", "Label": "True"}
{"Premises": ["Ted is confident", "Ted is calm", "Ted is quiet"], "Rules": ["If a person is confident and shy then this person is careless.", "If a person is beautiful and beautiful then this person is trustworthy.", "If a person is patient and calm then this person is curious.", "If a person is friendly then this person is intelligent.", "If a person is mature then this person is intelligent.", "If a person is friendly and mature then this person is lazy.", "If a person is angry then this person is patient.", "If a person is careless then this person is angry."], "Phenomenon": "Ted is curious", "PossibleCause": "Ted is shy", "Label": "True"}
{"Premises": ["Gary is beautiful", "Gary is positive", "Gary is generous", "Paul is calm", "Paul is positive"], "Rules": ["If a person is responsible then this person is friendly.", "If a person is beautiful and lazy then this person is curious.", "If a person is quiet and brave then this person is trustworthy.", "If a person is mature then this person is brave.", "If a person is shy then this person is confident.", "If a person is shy and brave then this person is trustworthy.", "If a person is curious then this person is responsible.", "If a person is friendly and positive then this person is calm."], "Phenomenon": "Gary is calm", "PossibleCause": "Gary is lazy", "Label": "True"}
{"Premises": ["David is lazy", "David is quiet", "David is patient"], "Rules": ["If a person is careless then this person is wise.", "If a person is confident then this person is wise.", "If a person is excited and confident then this person is shy.", "If a person is excited and excited then this person is happy.", "If a person is beautiful then this person is angry.", "If a person is friendly and quiet then this person is humorous.", "If a person is angry then this person is friendly.", "If a person is lazy and creative then this person is beautiful."], "Phenomenon": "David is humorous", "PossibleCause": "David is creative", "Label": "True"}
{"Premises": ["Helen is shy", "Helen is outgoing", "Helen is generous"], "Rules": ["If a person is nervous and angry then this person is friendly.", "If a person is positive then this person is responsible.", "If a person is angry then this person is creative.", "If a person is lazy then this person is mature.", "If a person is happy then this person is lazy.", "If a person is mature and outgoing then this person is honest.", "If a person is shy and calm then this person is happy.", "If a person is nervous and responsible then this person is friendly."], "Phenomenon": "Helen is honest", "PossibleCause": "Helen is calm", "Label": "True"}
{"Premises": ["David is quiet", "David is honest", "David is angry"], "Rules": ["If a person is trustworthy then this person is lazy.", "If a person is curious and curious then this person is enthusiastic.", "If a person is confident and curious then this person is lazy.", "If a person is excited and honest then this person is calm.", "If a person is intelligent then this person is excited.", "If a person is humorous then this person is enthusiastic.", "If a person is generous then this person is intelligent.", "If a person is quiet and kind then this person is generous."], "Phenomenon": "David is calm", "PossibleCause": "David is kind", "Label": "True"}
{"Premises": ["Jane is nervous", "Jane is friendly", "Jane is trustworthy"], "Rules": ["If a person is positive then this person is honest.", "If a person is honest and friendly then this person is beautiful.", "If a person is excited and loyal then this person is wise.", "If a person is excited and lazy then this person is wise.", "If a person is confident then this person is lazy.", "If a person is calm then this person is positive.", "If a person is nervous and quiet then this person is calm.", "If a person is excited then this person is curious."], "Phenomenon": "Jane is beautiful", "PossibleCause": "Jane is quiet", "Label": "True"}
