{"Premises": ["Anne is responsible", "Anne is lazy"], "Rules": ["If a person is humorous then this person is loyal.", "If a person is responsible and excited then this person is trustworthy", "If a person is honest then this person is loyal.", "If a person is humorous and shy then this person is intelligent.", "If a person is honest and humorous then this person is intelligent."], "Phenomenon": "Anne is trustworthy", "PossibleCause": "Anne is excited", "Label": "True"}
{"Premises": ["Lucy is honest", "Lucy is curious"], "Rules": ["If a person is shy then this person is calm.", "If a person is honest and mature then this person is wise", "If a person is humorous then this person is calm.", "If a person is shy and responsible then this person is intelligent.", "If a person is humorous and responsible then this person is intelligent."], "Phenomenon": "Lucy is wise", "PossibleCause": "Lucy is mature", "Label": "True"}
{"Premises": ["Jessica is wise", "Jessica is creative"], "Rules": ["If a person is beautiful and careless then this person is generous.", "If a person is beautiful then this person is enthusiastic.", "If a person is wise and responsible then this person is lazy", "If a person is humorous then this person is generous.", "If a person is excited and excited then this person is generous."], "Phenomenon": "Jessica is lazy", "PossibleCause": "Jessica is responsible", "Label": "True"}
{"Premises": ["Justin is calm", "Justin is intelligent"], "Rules": ["If a person is loyal then this person is excited.", "If a person is shy and quiet then this person is excited.", "If a person is calm and creative then this person is honest", "If a person is patient then this person is quiet.", "If a person is patient and quiet then this person is excited."], "Phenomenon": "Justin is honest", "PossibleCause": "Justin is creative", "Label": "True"}
{"Premises": ["Ted is generous", "Ted is shy"], "Rules": ["If a person is wise and positive then this person is outgoing.", "If a person is calm then this person is happy.", "If a person is wise and positive then this person is humorous.", "If a person is calm then this person is outgoing.", "If a person is generous and trustworthy then this person is intelligent"], "Phenomenon": "Ted is intelligent", "PossibleCause": "Ted is trustworthy", "Label": "True"}
{"Premises": ["Lucy is beautiful", "Lucy is loyal"], "Rules": ["If a person is careless then this person is trustworthy.", "If a person is beautiful and quiet then this person is confident", "If a person is careless and enthusiastic then this person is enthusiastic.", "If a person is honest and responsible then this person is enthusiastic.", "If a person is excited then this person is enthusiastic."], "Phenomenon": "Lucy is confident", "PossibleCause": "Lucy is quiet", "Label": "True"}
{"Premises": ["Peter is quiet", "Peter is wise"], "Rules": ["If a person is brave and patient then this person is enthusiastic.", "If a person is patient then this person is positive.", "If a person is excited and patient then this person is enthusiastic.", "If a person is patient then this person is enthusiastic.", "If a person is quiet and responsible then this person is humorous"], "Phenomenon": "Peter is humorous", "PossibleCause": "Peter is responsible", "Label": "True"}
{"Premises": ["Helen is mature", "Helen is creative"], "Rules": ["If a person is loyal then this person is friendly.", "If a person is patient and patient then this person is friendly.", "If a person is mature and responsible then this person is humorous", "If a person is patient then this person is beautiful.", "If a person is happy and loyal then this person is shy."], "Phenomenon": "Helen is humorous", "PossibleCause": "Helen is responsible", "Label": "True"}
{"Premises": ["Ted is angry", "Ted is outgoing"], "Rules": ["If a person is intelligent and confident then this person is nervous.", "If a person is loyal then this person is confident.", "If a person is angry and calm then this person is shy", "If a person is intelligent then this person is nervous.", "If a person is intelligent and confident then this person is confident."], "Phenomenon": "Ted is shy", "PossibleCause": "Ted is calm", "Label": "True"}
{"Premises": ["Lucy is patient", "Lucy is excited"], "Rules": ["If a person is enthusiastic then this person is lazy.", "If a person is enthusiastic and brave then this person is honest.", "If a person is patient and humorous then this person is angry", "If a person is curious then this person is honest.", "If a person is enthusiastic and lazy then this person is honest."], "Phenomenon": "Lucy is angry", "PossibleCause": "Lucy is humorous", "Label": "True"}
{"Premises": ["Paul is curious", "Paul is outgoing"], "Rules": ["If a person is intelligent and intelligent then this person is honest.", "If a person is curious and mature then this person is shy", "If a person is intelligent then this person is trustworthy.", "If a person is trustworthy then this person is honest.", "If a person is intelligent and honest then this person is beautiful."], "Phenomenon": "Paul is shy", "PossibleCause": "Paul is mature", "Label": "True"}
{"Premises": ["Peter is angry", "Peter is calm"], "Rules": ["If a person is positive and trustworthy then this person is beautiful.", "If a person is positive and quiet then this person is beautiful.", "If a person is angry and shy then this person is intelligent", "If a person is trustworthy then this person is beautiful.", "If a person is trustworthy then this person is quiet."], "Phenomenon": "Peter is intelligent", "PossibleCause": "Peter is shy", "Label": "True"}
{"Premises": ["Ted is creative", "Ted is kind", "Bob is creative", "Bob is kind"], "Rules": ["If a person is honest and responsible then this person is nervous.", "If a person is creative and trustworthy then this person is loyal", "If a person is patient then this person is intelligent.", "If a person is careless then this person is intelligent.", "If a person is patient and patient then this person is curious."], "Phenomenon": "Ted is loyal", "PossibleCause": "Ted is trustworthy", "Label": "True"}
{"Premises": ["Thomas is kind", "Thomas is outgoing"], "Rules": ["If a person is creative and confident then this person is confident.", "If a person is kind and trustworthy then this person is mature", "If a person is creative and confident then this person is responsible.", "If a person is careless then this person is confident.", "If a person is lazy then this person is confident."], "Phenomenon": "Thomas is mature", "PossibleCause": "Thomas is trustworthy", "Label": "True"}
{"Premises": ["Adam is positive", "Adam is quiet"], "Rules": ["If a person is nervous then this person is creative.", "If a person is beautiful and creative then this person is confident.", "If a person is beautiful and creative then this person is confident.", "If a person is positive and honest then this person is mature", "If a person is creative then this person is responsible."], "Phenomenon": "Adam is mature", "PossibleCause": "Adam is honest", "Label": "True"}
{"Premises": ["Justin is nervous", "Justin is angry"], "Rules": ["If a person is nervous and brave then this person is humorous", "If a person is creative and patient then this person is excited.", "If a person is kind then this person is patient.", "If a person is responsible and patient then this person is friendly.", "If a person is careless then this person is kind."], "Phenomenon": "Justin is humorous", "PossibleCause": "Justin is brave", "Label": "True"}
{"Premises": ["Peter is kind", "Peter is patient"], "Rules": ["If a person is trustworthy and calm then this person is enthusiastic.", "If a person is trustworthy and careless then this person is enthusiastic.", "If a person is kind and angry then this person is nervous", "If a person is trustworthy then this person is careless.", "If a person is excited then this person is calm."], "Phenomenon": "Peter is nervous", "PossibleCause": "Peter is angry", "Label": "True"}
{"Premises": ["Robert is honest", "Robert is friendly"], "Rules": ["If a person is honest and trustworthy then this person is quiet", "If a person is careless then this person is enthusiastic.", "If a person is wise then this person is enthusiastic.", "If a person is wise and humorous then this person is happy.", "If a person is loyal and wise then this person is enthusiastic."], "Phenomenon": "Robert is quiet", "PossibleCause": "Robert is trustworthy", "Label": "True"}
{"Premises": ["Anne is excited", "Anne is intelligent"], "Rules": ["If a person is kind then this person is quiet.", "If a person is kind and curious then this person is quiet.", "If a person is kind and loyal then this person is beautiful.", "If a person is excited and enthusiastic then this person is patient", "If a person is calm then this person is shy."], "Phenomenon": "Anne is patient", "PossibleCause": "Anne is enthusiastic", "Label": "True"}
{"Premises": ["Sandy is shy", "Sandy is brave"], "Rules": ["If a person is shy and humorous then this person is quiet", "If a person is enthusiastic and beautiful then this person is beautiful.", "If a person is trustworthy then this person is trustworthy.", "If a person is honest and beautiful then this person is excited.", "If a person is trustworthy then this person is trustworthy."], "Phenomenon": "Sandy is quiet", "PossibleCause": "Sandy is humorous", "Label": "True"}
{"Premises": ["Eric is positive", "Eric is calm"], "Rules": ["If a person is nervous and curious then this person is curious.", "If a person is positive and kind then this person is honest", "If a person is intelligent then this person is shy.", "If a person is quiet then this person is quiet.", "If a person is friendly and curious then this person is shy."], "Phenomenon": "Eric is honest", "PossibleCause": "Eric is kind", "Label": "True"}
{"Premises": ["Eric is generous", "Eric is enthusiastic"], "Rules": ["If a person is patient then this person is loyal.", "If a person is patient then this person is patient.", "If a person is generous and excited then this person is calm", "If a person is creative and outgoing then this person is lazy.", "If a person is trustworthy and patient then this person is loyal."], "Phenomenon": "Eric is calm", "PossibleCause": "Eric is excited", "Label": "True"}
{"Premises": ["Lucy is trustworthy", "Lucy is angry"], "Rules": ["If a person is trustworthy and loyal then this person is lazy", "If a person is nervous then this person is calm.", "If a person is enthusiastic and nervous then this person is intelligent.", "If a person is calm then this person is intelligent.", "If a person is happy and nervous then this person is excited."], "Phenomenon": "Lucy is lazy", "PossibleCause": "Lucy is happy", "Label": "False"}
{"Premises": ["Justin is mature", "Justin is loyal"], "Rules": ["If a person is excited then this person is positive.", "If a person is friendly and excited then this person is happy.", "If a person is brave then this person is generous.", "If a person is mature and trustworthy then this person is enthusiastic", "If a person is excited and shy then this person is positive."], "Phenomenon": "Justin is enthusiastic", "PossibleCause": "Justin is trustworthy", "Label": "True"}
{"Premises": ["Sandy is brave", "Sandy is quiet"], "Rules": ["If a person is humorous then this person is humorous.", "If a person is positive and trustworthy then this person is angry.", "If a person is confident and humorous then this person is intelligent.", "If a person is brave and responsible then this person is mature", "If a person is positive then this person is humorous."], "Phenomenon": "Sandy is mature", "PossibleCause": "Sandy is responsible", "Label": "True"}
{"Premises": ["Paul is humorous", "Paul is creative", "Peter is humorous", "Peter is creative"], "Rules": ["If a person is brave then this person is excited.", "If a person is humorous and outgoing then this person is careless", "If a person is curious and mature then this person is excited.", "If a person is curious and mature then this person is excited.", "If a person is honest then this person is mature."], "Phenomenon": "Paul is careless", "PossibleCause": "Paul is outgoing", "Label": "True"}
{"Premises": ["Jessica is trustworthy", "Jessica is quiet"], "Rules": ["If a person is happy then this person is brave.", "If a person is trustworthy and patient then this person is responsible", "If a person is happy and kind then this person is brave.", "If a person is friendly and kind then this person is brave.", "If a person is happy then this person is brave."], "Phenomenon": "Jessica is responsible", "PossibleCause": "Jessica is patient", "Label": "True"}
{"Premises": ["Lisa is patient", "Lisa is honest"], "Rules": ["If a person is creative then this person is intelligent.", "If a person is patient and trustworthy then this person is generous", "If a person is outgoing and friendly then this person is happy.", "If a person is loyal then this person is wise.", "If a person is loyal and intelligent then this person is wise."], "Phenomenon": "Lisa is generous", "PossibleCause": "Lisa is trustworthy", "Label": "True"}
{"Premises": ["Jessica is mature", "Jessica is friendly"], "Rules": ["If a person is responsible and responsible then this person is brave.", "If a person is responsible and responsible then this person is excited.", "If a person is mature and angry then this person is kind", "If a person is humorous then this person is humorous.", "If a person is careless then this person is humorous."], "Phenomenon": "Jessica is kind", "PossibleCause": "Jessica is angry", "Label": "True"}
{"Premises": ["Justin is friendly", "Justin is positive"], "Rules": ["If a person is enthusiastic and careless then this person is happy.", "If a person is friendly and honest then this person is responsible", "If a person is calm and careless then this person is happy.", "If a person is lazy then this person is kind.", "If a person is careless then this person is happy."], "Phenomenon": "Justin is responsible", "PossibleCause": "Justin is honest", "Label": "True"}
{"Premises": ["Henry is excited", "Henry is patient"], "Rules": ["If a person is calm and responsible then this person is creative.", "If a person is calm then this person is responsible.", "If a person is shy then this person is wise.", "If a person is brave and curious then this person is wise.", "If a person is excited and outgoing then this person is humorous"], "Phenomenon": "Henry is humorous", "PossibleCause": "Henry is outgoing", "Label": "True"}
{"Premises": ["Sandy is careless", "Sandy is trustworthy"], "Rules": ["If a person is loyal then this person is angry.", "If a person is loyal and kind then this person is outgoing.", "If a person is positive and loyal then this person is kind.", "If a person is careless and creative then this person is humorous", "If a person is positive then this person is angry."], "Phenomenon": "Sandy is humorous", "PossibleCause": "Sandy is creative", "Label": "True"}
{"Premises": ["Frank is kind", "Frank is angry"], "Rules": ["If a person is kind and curious then this person is enthusiastic", "If a person is humorous and patient then this person is happy.", "If a person is humorous and patient then this person is nervous.", "If a person is honest then this person is shy.", "If a person is generous then this person is shy."], "Phenomenon": "Frank is enthusiastic", "PossibleCause": "Frank is generous", "Label": "False"}
{"Premises": ["Helen is curious", "Helen is loyal"], "Rules": ["If a person is brave and happy then this person is honest.", "If a person is curious and lazy then this person is careless", "If a person is brave and calm then this person is honest.", "If a person is happy then this person is confident.", "If a person is brave then this person is happy."], "Phenomenon": "Helen is careless", "PossibleCause": "Helen is lazy", "Label": "True"}
{"Premises": ["Peter is mature", "Peter is loyal"], "Rules": ["If a person is excited then this person is intelligent.", "If a person is happy and nervous then this person is kind.", "If a person is mature and careless then this person is outgoing", "If a person is happy then this person is nervous.", "If a person is responsible and intelligent then this person is nervous."], "Phenomenon": "Peter is outgoing", "PossibleCause": "Peter is excited", "Label": "False"}
{"Premises": ["Robert is quiet", "Robert is kind"], "Rules": ["If a person is outgoing and mature then this person is positive.", "If a person is happy then this person is mature.", "If a person is happy then this person is positive.", "If a person is quiet and patient then this person is brave", "If a person is outgoing and responsible then this person is shy."], "Phenomenon": "Robert is brave", "PossibleCause": "Robert is patient", "Label": "True"}
{"Premises": ["Bob is enthusiastic", "Bob is positive"], "Rules": ["If a person is angry and angry then this person is nervous.", "If a person is enthusiastic and careless then this person is humorous", "If a person is wise then this person is wise.", "If a person is shy then this person is wise.", "If a person is kind and nervous then this person is nervous."], "Phenomenon": "Bob is humorous", "PossibleCause": "Bob is careless", "Label": "True"}
{"Premises": ["Mark is outgoing", "Mark is kind"], "Rules": ["If a person is enthusiastic and responsible then this person is beautiful.", "If a person is outgoing and generous then this person is loyal", "If a person is responsible then this person is responsible.", "If a person is enthusiastic then this person is trustworthy.", "If a person is happy and responsible then this person is nervous."], "Phenomenon": "Mark is loyal", "PossibleCause": "Mark is generous", "Label": "True"}
{"Premises": ["Jane is honest", "Jane is trustworthy"], "Rules": ["If a person is kind then this person is intelligent.", "If a person is creative then this person is confident.", "If a person is kind and confident then this person is confident.", "If a person is honest and angry then this person is curious", "If a person is calm and confident then this person is confident."], "Phenomenon": "Jane is curious", "PossibleCause": "Jane is angry", "Label": "True"}
{"Premises": ["Henry is humorous", "Henry is patient"], "Rules": ["If a person is humorous and intelligent then this person is brave", "If a person is nervous and responsible then this person is shy.", "If a person is responsible then this person is trustworthy.", "If a person is honest then this person is trustworthy.", "If a person is friendly and honest then this person is mature."], "Phenomenon": "Henry is brave", "PossibleCause": "Henry is friendly", "Label": "False"}
{"Premises": ["Peter is trustworthy", "Peter is careless"], "Rules": ["If a person is friendly then this person is outgoing.", "If a person is curious and lazy then this person is calm.", "If a person is curious and friendly then this person is positive.", "If a person is friendly then this person is lazy.", "If a person is trustworthy and wise then this person is generous"], "Phenomenon": "Peter is generous", "PossibleCause": "Peter is wise", "Label": "True"}
{"Premises": ["Robin is wise", "Robin is calm"], "Rules": ["If a person is responsible and mature then this person is lazy.", "If a person is wise and generous then this person is brave", "If a person is nervous and lazy then this person is shy.", "If a person is trustworthy then this person is lazy.", "If a person is responsible then this person is outgoing."], "Phenomenon": "Robin is brave", "PossibleCause": "Robin is generous", "Label": "True"}
{"Premises": ["Lucy is responsible", "Lucy is generous"], "Rules": ["If a person is shy and nervous then this person is lazy.", "If a person is creative then this person is nervous.", "If a person is responsible and confident then this person is careless", "If a person is creative then this person is lazy.", "If a person is creative and nervous then this person is mature."], "Phenomenon": "Lucy is careless", "PossibleCause": "Lucy is confident", "Label": "True"}
{"Premises": ["Adam is positive", "Adam is friendly"], "Rules": ["If a person is enthusiastic and confident then this person is excited.", "If a person is patient then this person is angry.", "If a person is positive and intelligent then this person is brave", "If a person is generous and excited then this person is trustworthy.", "If a person is generous then this person is excited."], "Phenomenon": "Adam is brave", "PossibleCause": "Adam is intelligent", "Label": "True"}
{"Premises": ["Eric is careless", "Eric is lazy"], "Rules": ["If a person is curious and kind then this person is trustworthy.", "If a person is kind then this person is creative.", "If a person is careless and wise then this person is calm", "If a person is excited and kind then this person is trustworthy.", "If a person is generous then this person is trustworthy."], "Phenomenon": "Eric is calm", "PossibleCause": "Eric is wise", "Label": "True"}
{"Premises": ["Lucy is careless", "Lucy is loyal"], "Rules": ["If a person is friendly and humorous then this person is curious.", "If a person is friendly then this person is curious.", "If a person is intelligent and friendly then this person is enthusiastic.", "If a person is careless and trustworthy then this person is confident", "If a person is friendly then this person is curious."], "Phenomenon": "Lucy is confident", "PossibleCause": "Lucy is trustworthy", "Label": "True"}
{"Premises": ["Helen is honest", "Helen is beautiful"], "Rules": ["If a person is enthusiastic and confident then this person is lazy.", "If a person is outgoing and confident then this person is friendly.", "If a person is enthusiastic then this person is quiet.", "If a person is honest and angry then this person is excited", "If a person is confident then this person is lazy."], "Phenomenon": "Helen is excited", "PossibleCause": "Helen is enthusiastic", "Label": "False"}
{"Premises": ["Ted is patient", "Ted is friendly"], "Rules": ["If a person is creative then this person is creative.", "If a person is responsible and creative then this person is angry.", "If a person is responsible then this person is excited.", "If a person is responsible and creative then this person is excited.", "If a person is patient and honest then this person is outgoing"], "Phenomenon": "Ted is outgoing", "PossibleCause": "Ted is honest", "Label": "True"}
{"Premises": ["Jack is quiet", "Jack is intelligent"], "Rules": ["If a person is brave then this person is mature.", "If a person is beautiful and patient then this person is patient.", "If a person is beautiful and mature then this person is curious.", "If a person is quiet and kind then this person is friendly", "If a person is excited then this person is mature."], "Phenomenon": "Jack is friendly", "PossibleCause": "Jack is kind", "Label": "True"}
{"Premises": ["Grace is mature", "Grace is humorous"], "Rules": ["If a person is excited and patient then this person is brave.", "If a person is mature and positive then this person is angry", "If a person is nervous then this person is beautiful.", "If a person is nervous and generous then this person is wise.", "If a person is generous then this person is patient."], "Phenomenon": "Grace is angry", "PossibleCause": "Grace is positive", "Label": "True"}
{"Premises": ["Jack is humorous", "Jack is friendly"], "Rules": ["If a person is confident and shy then this person is shy.", "If a person is confident then this person is shy.", "If a person is excited and shy then this person is lazy.", "If a person is wise then this person is shy.", "If a person is humorous and angry then this person is mature"], "Phenomenon": "Jack is mature", "PossibleCause": "Jack is angry", "Label": "True"}
{"Premises": ["Sandy is calm", "Sandy is outgoing"], "Rules": ["If a person is patient and angry then this person is quiet.", "If a person is patient and angry then this person is quiet.", "If a person is beautiful then this person is angry.", "If a person is calm and intelligent then this person is careless", "If a person is trustworthy then this person is creative."], "Phenomenon": "Sandy is careless", "PossibleCause": "Sandy is intelligent", "Label": "True"}
{"Premises": ["Mark is beautiful", "Mark is intelligent"], "Rules": ["If a person is beautiful and outgoing then this person is wise", "If a person is angry then this person is positive.", "If a person is loyal and angry then this person is curious.", "If a person is brave then this person is brave.", "If a person is loyal and brave then this person is curious."], "Phenomenon": "Mark is wise", "PossibleCause": "Mark is outgoing", "Label": "True"}
{"Premises": ["Frank is trustworthy", "Frank is wise"], "Rules": ["If a person is patient and generous then this person is enthusiastic.", "If a person is generous and generous then this person is enthusiastic.", "If a person is positive then this person is calm.", "If a person is trustworthy and honest then this person is nervous", "If a person is patient then this person is outgoing."], "Phenomenon": "Frank is nervous", "PossibleCause": "Frank is honest", "Label": "True"}
{"Premises": ["Jane is trustworthy", "Jane is calm"], "Rules": ["If a person is happy then this person is humorous.", "If a person is trustworthy and responsible then this person is wise", "If a person is angry and angry then this person is careless.", "If a person is angry and outgoing then this person is careless.", "If a person is happy then this person is humorous."], "Phenomenon": "Jane is wise", "PossibleCause": "Jane is responsible", "Label": "True"}
{"Premises": ["Sandy is calm", "Sandy is kind"], "Rules": ["If a person is happy then this person is humorous.", "If a person is happy then this person is beautiful.", "If a person is trustworthy and beautiful then this person is friendly.", "If a person is loyal and humorous then this person is friendly.", "If a person is calm and brave then this person is nervous"], "Phenomenon": "Sandy is nervous", "PossibleCause": "Sandy is brave", "Label": "True"}
{"Premises": ["Ted is patient", "Ted is creative"], "Rules": ["If a person is patient and enthusiastic then this person is generous", "If a person is quiet and honest then this person is mature.", "If a person is brave then this person is kind.", "If a person is quiet and quiet then this person is mature.", "If a person is confident then this person is kind."], "Phenomenon": "Ted is generous", "PossibleCause": "Ted is calm", "Label": "False"}
{"Premises": ["Peter is nervous", "Peter is humorous"], "Rules": ["If a person is nervous and intelligent then this person is lazy", "If a person is outgoing then this person is positive.", "If a person is mature and outgoing then this person is careless.", "If a person is friendly and careless then this person is careless.", "If a person is positive then this person is positive."], "Phenomenon": "Peter is lazy", "PossibleCause": "Peter is intelligent", "Label": "True"}
{"Premises": ["Mark is honest", "Mark is trustworthy"], "Rules": ["If a person is mature then this person is kind.", "If a person is honest and intelligent then this person is brave", "If a person is mature and beautiful then this person is kind.", "If a person is wise then this person is kind.", "If a person is enthusiastic and mature then this person is excited."], "Phenomenon": "Mark is brave", "PossibleCause": "Mark is intelligent", "Label": "True"}
{"Premises": ["Bob is positive", "Bob is intelligent"], "Rules": ["If a person is positive and mature then this person is enthusiastic", "If a person is lazy and wise then this person is kind.", "If a person is brave then this person is kind.", "If a person is calm then this person is kind.", "If a person is honest and lazy then this person is trustworthy."], "Phenomenon": "Bob is enthusiastic", "PossibleCause": "Bob is mature", "Label": "True"}
{"Premises": ["Denis is generous", "Denis is positive"], "Rules": ["If a person is happy then this person is lazy.", "If a person is happy then this person is loyal.", "If a person is generous and trustworthy then this person is honest", "If a person is quiet and loyal then this person is responsible.", "If a person is confident and kind then this person is kind."], "Phenomenon": "Denis is honest", "PossibleCause": "Denis is trustworthy", "Label": "True"}
{"Premises": ["Peter is loyal", "Peter is responsible"], "Rules": ["If a person is kind then this person is lazy.", "If a person is kind then this person is honest.", "If a person is kind and honest then this person is shy.", "If a person is loyal and trustworthy then this person is calm", "If a person is kind and honest then this person is honest."], "Phenomenon": "Peter is calm", "PossibleCause": "Peter is kind", "Label": "False"}
{"Premises": ["Jane is positive", "Jane is quiet"], "Rules": ["If a person is nervous and brave then this person is patient.", "If a person is enthusiastic and intelligent then this person is responsible.", "If a person is nervous then this person is intelligent.", "If a person is nervous then this person is patient.", "If a person is positive and trustworthy then this person is honest"], "Phenomenon": "Jane is honest", "PossibleCause": "Jane is trustworthy", "Label": "True"}
{"Premises": ["Thomas is kind", "Thomas is beautiful"], "Rules": ["If a person is generous and curious then this person is mature.", "If a person is curious then this person is mature.", "If a person is kind and creative then this person is calm", "If a person is angry and mature then this person is trustworthy.", "If a person is responsible then this person is curious."], "Phenomenon": "Thomas is calm", "PossibleCause": "Thomas is creative", "Label": "True"}
{"Premises": ["Paul is outgoing", "Paul is friendly"], "Rules": ["If a person is happy then this person is careless.", "If a person is calm then this person is careless.", "If a person is outgoing and trustworthy then this person is lazy", "If a person is calm and humorous then this person is careless.", "If a person is honest and beautiful then this person is loyal."], "Phenomenon": "Paul is lazy", "PossibleCause": "Paul is trustworthy", "Label": "True"}
{"Premises": ["Charles is patient", "Charles is enthusiastic"], "Rules": ["If a person is excited then this person is quiet.", "If a person is excited then this person is careless.", "If a person is creative and careless then this person is nervous.", "If a person is curious and excited then this person is nervous.", "If a person is patient and honest then this person is humorous"], "Phenomenon": "Charles is humorous", "PossibleCause": "Charles is honest", "Label": "True"}
{"Premises": ["Peter is friendly", "Peter is shy"], "Rules": ["If a person is angry then this person is angry.", "If a person is patient and angry then this person is humorous.", "If a person is friendly and mature then this person is nervous", "If a person is quiet then this person is humorous.", "If a person is patient and quiet then this person is intelligent."], "Phenomenon": "Peter is nervous", "PossibleCause": "Peter is mature", "Label": "True"}
{"Premises": ["David is brave", "David is patient"], "Rules": ["If a person is enthusiastic and confident then this person is outgoing.", "If a person is confident then this person is outgoing.", "If a person is honest then this person is confident.", "If a person is enthusiastic and outgoing then this person is angry.", "If a person is brave and creative then this person is trustworthy"], "Phenomenon": "David is trustworthy", "PossibleCause": "David is creative", "Label": "True"}
{"Premises": ["Adam is responsible", "Adam is excited"], "Rules": ["If a person is enthusiastic and careless then this person is confident.", "If a person is enthusiastic then this person is generous.", "If a person is enthusiastic and generous then this person is confident.", "If a person is responsible and trustworthy then this person is quiet", "If a person is enthusiastic then this person is generous."], "Phenomenon": "Adam is quiet", "PossibleCause": "Adam is trustworthy", "Label": "True"}
{"Premises": ["Denis is creative", "Denis is lazy"], "Rules": ["If a person is confident and friendly then this person is friendly.", "If a person is confident then this person is curious.", "If a person is creative and generous then this person is mature", "If a person is responsible and curious then this person is outgoing.", "If a person is nervous then this person is curious."], "Phenomenon": "Denis is mature", "PossibleCause": "Denis is generous", "Label": "True"}
{"Premises": ["Peter is creative", "Peter is nervous"], "Rules": ["If a person is responsible then this person is confident.", "If a person is confident then this person is confident.", "If a person is beautiful and trustworthy then this person is positive.", "If a person is responsible and confident then this person is trustworthy.", "If a person is creative and outgoing then this person is excited"], "Phenomenon": "Peter is excited", "PossibleCause": "Peter is outgoing", "Label": "True"}
{"Premises": ["Anne is outgoing", "Anne is responsible"], "Rules": ["If a person is loyal and kind then this person is confident.", "If a person is kind and kind then this person is enthusiastic.", "If a person is loyal then this person is brave.", "If a person is outgoing and humorous then this person is patient", "If a person is angry then this person is brave."], "Phenomenon": "Anne is patient", "PossibleCause": "Anne is humorous", "Label": "True"}
{"Premises": ["Justin is excited", "Justin is responsible", "Denis is excited", "Denis is calm", "Denis is loyal"], "Rules": ["If a person is excited and lazy then this person is nervous", "If a person is happy then this person is brave.", "If a person is intelligent and happy then this person is outgoing.", "If a person is enthusiastic and happy then this person is outgoing.", "If a person is enthusiastic then this person is brave."], "Phenomenon": "Justin is nervous", "PossibleCause": "Justin is intelligent", "Label": "False"}
{"Premises": ["Peter is mature", "Peter is honest"], "Rules": ["If a person is angry and happy then this person is nervous.", "If a person is lazy then this person is happy.", "If a person is mature and beautiful then this person is excited", "If a person is wise and happy then this person is happy.", "If a person is lazy then this person is happy."], "Phenomenon": "Peter is excited", "PossibleCause": "Peter is beautiful", "Label": "True"}
{"Premises": ["Ted is wise", "Ted is honest"], "Rules": ["If a person is confident then this person is humorous.", "If a person is quiet and generous then this person is friendly.", "If a person is generous then this person is confident.", "If a person is generous and generous then this person is humorous.", "If a person is wise and trustworthy then this person is enthusiastic"], "Phenomenon": "Ted is enthusiastic", "PossibleCause": "Ted is trustworthy", "Label": "True"}
{"Premises": ["Jack is positive", "Jack is trustworthy"], "Rules": ["If a person is excited and generous then this person is nervous.", "If a person is confident and shy then this person is generous.", "If a person is positive and loyal then this person is beautiful", "If a person is kind then this person is shy.", "If a person is confident then this person is shy."], "Phenomenon": "Jack is beautiful", "PossibleCause": "Jack is loyal", "Label": "True"}
{"Premises": ["Peter is enthusiastic", "Peter is trustworthy"], "Rules": ["If a person is beautiful and friendly then this person is excited.", "If a person is honest then this person is loyal.", "If a person is enthusiastic and mature then this person is shy", "If a person is honest and wise then this person is calm.", "If a person is friendly then this person is friendly."], "Phenomenon": "Peter is shy", "PossibleCause": "Peter is mature", "Label": "True"}
{"Premises": ["Paul is excited", "Paul is patient"], "Rules": ["If a person is honest and honest then this person is careless.", "If a person is mature and friendly then this person is enthusiastic.", "If a person is trustworthy then this person is careless.", "If a person is friendly then this person is enthusiastic.", "If a person is excited and creative then this person is quiet"], "Phenomenon": "Paul is quiet", "PossibleCause": "Paul is creative", "Label": "True"}
{"Premises": ["Mark is creative", "Mark is excited"], "Rules": ["If a person is intelligent then this person is confident.", "If a person is intelligent and brave then this person is happy.", "If a person is intelligent and brave then this person is happy.", "If a person is loyal then this person is brave.", "If a person is creative and mature then this person is enthusiastic"], "Phenomenon": "Mark is enthusiastic", "PossibleCause": "Mark is mature", "Label": "True"}
{"Premises": ["Jack is quiet", "Jack is beautiful"], "Rules": ["If a person is nervous then this person is humorous.", "If a person is loyal and enthusiastic then this person is outgoing.", "If a person is quiet and confident then this person is patient", "If a person is enthusiastic and enthusiastic then this person is honest.", "If a person is kind then this person is kind."], "Phenomenon": "Jack is patient", "PossibleCause": "Jack is confident", "Label": "True"}
{"Premises": ["Justin is shy", "Justin is beautiful"], "Rules": ["If a person is loyal then this person is angry.", "If a person is confident and honest then this person is intelligent.", "If a person is loyal and kind then this person is intelligent.", "If a person is angry then this person is humorous.", "If a person is shy and responsible then this person is creative"], "Phenomenon": "Justin is creative", "PossibleCause": "Justin is responsible", "Label": "True"}
{"Premises": ["Sandy is happy", "Sandy is friendly"], "Rules": ["If a person is beautiful then this person is trustworthy.", "If a person is enthusiastic and loyal then this person is loyal.", "If a person is happy and generous then this person is outgoing", "If a person is brave and beautiful then this person is honest.", "If a person is enthusiastic then this person is excited."], "Phenomenon": "Sandy is outgoing", "PossibleCause": "Sandy is generous", "Label": "True"}
{"Premises": ["Betty is happy", "Betty is nervous"], "Rules": ["If a person is outgoing and trustworthy then this person is kind.", "If a person is outgoing and trustworthy then this person is confident.", "If a person is trustworthy then this person is trustworthy.", "If a person is outgoing then this person is confident.", "If a person is happy and shy then this person is angry"], "Phenomenon": "Betty is angry", "PossibleCause": "Betty is shy", "Label": "True"}
{"Premises": ["Eric is honest", "Eric is happy"], "Rules": ["If a person is honest and lazy then this person is enthusiastic", "If a person is responsible and confident then this person is careless.", "If a person is brave then this person is confident.", "If a person is excited and wise then this person is careless.", "If a person is brave then this person is wise."], "Phenomenon": "Eric is enthusiastic", "PossibleCause": "Eric is lazy", "Label": "True"}
{"Premises": ["Anne is intelligent", "Anne is responsible"], "Rules": ["If a person is intelligent and friendly then this person is beautiful", "If a person is honest then this person is kind.", "If a person is outgoing and quiet then this person is creative.", "If a person is loyal then this person is honest.", "If a person is loyal and quiet then this person is quiet."], "Phenomenon": "Anne is beautiful", "PossibleCause": "Anne is loyal", "Label": "False"}
{"Premises": ["Frank is enthusiastic", "Frank is humorous"], "Rules": ["If a person is happy then this person is outgoing.", "If a person is enthusiastic and loyal then this person is curious", "If a person is patient then this person is mature.", "If a person is happy and nervous then this person is outgoing.", "If a person is happy and patient then this person is mature."], "Phenomenon": "Frank is curious", "PossibleCause": "Frank is loyal", "Label": "True"}
{"Premises": ["Tom is trustworthy", "Tom is beautiful"], "Rules": ["If a person is loyal and loyal then this person is mature.", "If a person is positive then this person is lazy.", "If a person is trustworthy and angry then this person is kind", "If a person is intelligent and patient then this person is careless.", "If a person is positive then this person is patient."], "Phenomenon": "Tom is kind", "PossibleCause": "Tom is angry", "Label": "True"}
{"Premises": ["Charles is wise", "Charles is lazy"], "Rules": ["If a person is friendly and friendly then this person is kind.", "If a person is wise and quiet then this person is intelligent", "If a person is friendly then this person is humorous.", "If a person is friendly and friendly then this person is outgoing.", "If a person is beautiful then this person is humorous."], "Phenomenon": "Charles is intelligent", "PossibleCause": "Charles is beautiful", "Label": "False"}
{"Premises": ["Ted is angry", "Ted is generous"], "Rules": ["If a person is quiet and enthusiastic then this person is wise.", "If a person is quiet and quiet then this person is wise.", "If a person is quiet then this person is wise.", "If a person is angry and shy then this person is responsible", "If a person is brave then this person is trustworthy."], "Phenomenon": "Ted is responsible", "PossibleCause": "Ted is shy", "Label": "True"}
{"Premises": ["Eric is outgoing", "Eric is positive"], "Rules": ["If a person is calm and calm then this person is careless.", "If a person is calm then this person is creative.", "If a person is honest and calm then this person is humorous.", "If a person is honest then this person is kind.", "If a person is outgoing and happy then this person is nervous"], "Phenomenon": "Eric is nervous", "PossibleCause": "Eric is happy", "Label": "True"}
{"Premises": ["Denis is excited", "Denis is humorous"], "Rules": ["If a person is responsible and wise then this person is wise.", "If a person is excited and calm then this person is friendly", "If a person is generous then this person is wise.", "If a person is creative and loyal then this person is wise.", "If a person is generous then this person is loyal."], "Phenomenon": "Denis is friendly", "PossibleCause": "Denis is calm", "Label": "True"}
{"Premises": ["Sandy is creative", "Sandy is honest"], "Rules": ["If a person is excited and responsible then this person is nervous.", "If a person is excited and responsible then this person is generous.", "If a person is excited then this person is nervous.", "If a person is patient then this person is nervous.", "If a person is creative and humorous then this person is confident"], "Phenomenon": "Sandy is confident", "PossibleCause": "Sandy is humorous", "Label": "True"}
{"Premises": ["David is positive", "David is generous"], "Rules": ["If a person is calm and wise then this person is wise.", "If a person is calm and calm then this person is mature.", "If a person is intelligent then this person is angry.", "If a person is positive and curious then this person is brave", "If a person is intelligent then this person is angry."], "Phenomenon": "David is brave", "PossibleCause": "David is curious", "Label": "True"}
{"Premises": ["Adam is creative", "Adam is loyal"], "Rules": ["If a person is creative and confident then this person is humorous", "If a person is outgoing then this person is enthusiastic.", "If a person is outgoing then this person is friendly.", "If a person is intelligent and happy then this person is enthusiastic.", "If a person is responsible and responsible then this person is beautiful."], "Phenomenon": "Adam is humorous", "PossibleCause": "Adam is confident", "Label": "True"}
{"Premises": ["Lisa is careless", "Lisa is friendly"], "Rules": ["If a person is mature and lazy then this person is lazy.", "If a person is enthusiastic and trustworthy then this person is confident.", "If a person is trustworthy then this person is trustworthy.", "If a person is careless and brave then this person is beautiful", "If a person is trustworthy then this person is trustworthy."], "Phenomenon": "Lisa is beautiful", "PossibleCause": "Lisa is brave", "Label": "True"}
{"Premises": ["Robin is wise", "Robin is careless"], "Rules": ["If a person is enthusiastic then this person is outgoing.", "If a person is patient and outgoing then this person is beautiful.", "If a person is patient then this person is outgoing.", "If a person is wise and generous then this person is intelligent", "If a person is enthusiastic and calm then this person is beautiful."], "Phenomenon": "Robin is intelligent", "PossibleCause": "Robin is generous", "Label": "True"}
{"Premises": ["Jane is responsible", "Jane is calm"], "Rules": ["If a person is happy and mature then this person is creative.", "If a person is responsible and outgoing then this person is kind", "If a person is happy and confident then this person is creative.", "If a person is quiet then this person is mature.", "If a person is angry then this person is creative."], "Phenomenon": "Jane is kind", "PossibleCause": "Jane is angry", "Label": "False"}
{"Premises": ["Jessica is beautiful", "Jessica is trustworthy"], "Rules": ["If a person is beautiful and lazy then this person is calm", "If a person is honest and patient then this person is confident.", "If a person is patient and outgoing then this person is excited.", "If a person is outgoing then this person is excited.", "If a person is honest then this person is outgoing."], "Phenomenon": "Jessica is calm", "PossibleCause": "Jessica is lazy", "Label": "True"}
{"Premises": ["Tom is nervous", "Tom is angry"], "Rules": ["If a person is quiet then this person is lazy.", "If a person is calm then this person is lazy.", "If a person is generous and mature then this person is mature.", "If a person is nervous and intelligent then this person is humorous", "If a person is happy and calm then this person is brave."], "Phenomenon": "Tom is humorous", "PossibleCause": "Tom is quiet", "Label": "False"}
{"Premises": ["James is angry", "James is generous"], "Rules": ["If a person is responsible and curious then this person is beautiful.", "If a person is angry and enthusiastic then this person is friendly", "If a person is creative and curious then this person is excited.", "If a person is creative then this person is beautiful.", "If a person is responsible then this person is beautiful."], "Phenomenon": "James is friendly", "PossibleCause": "James is enthusiastic", "Label": "True"}
